[
  {
    "id" : "http://arxiv.org/abs/2405.00616v1",
    "title" : "An Expectation-Maximization Relaxed Method for Privacy Funnel",
    "summary" : "The privacy funnel (PF) gives a framework of privacy-preserving data release,\nwhere the goal is to release useful data while also limiting the exposure of\nassociated sensitive information. This framework has garnered significant\ninterest due to its broad applications in characterization of the\nprivacy-utility tradeoff. Hence, there is a strong motivation to develop\nnumerical methods with high precision and theoretical convergence guarantees.\nIn this paper, we propose a novel relaxation variant based on Jensen's\ninequality of the objective function for the computation of the PF problem.\nThis model is proved to be equivalent to the original in terms of optimal\nsolutions and optimal values. Based on our proposed model, we develop an\naccurate algorithm which only involves closed-form iterations. The convergence\nof our algorithm is theoretically guaranteed through descent estimation and\nPinsker's inequality. Numerical results demonstrate the effectiveness of our\nproposed algorithm.",
    "updated" : "2024-05-01T16:35:44Z",
    "published" : "2024-05-01T16:35:44Z",
    "authors" : [
      {
        "name" : "Lingyi Chen"
      },
      {
        "name" : "Jiachuan Ye"
      },
      {
        "name" : "Shitong Wu"
      },
      {
        "name" : "Huihui Wu"
      },
      {
        "name" : "Hao Wu"
      },
      {
        "name" : "Wenyi Zhang"
      }
    ],
    "categories" : [
      "cs.IT",
      "math.IT"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.00596v1",
    "title" : "Unbundle-Rewrite-Rebundle: Runtime Detection and Rewriting of\n  Privacy-Harming Code in JavaScript Bundles",
    "summary" : "This work presents Unbundle-Rewrite-Rebundle (URR), a system for detecting\nprivacy-harming portions of bundled JavaScript code, and rewriting that code at\nruntime to remove the privacy harming behavior without breaking the surrounding\ncode or overall application. URR is a novel solution to the problem of\nJavaScript bundles, where websites pre-compile multiple code units into a\nsingle file, making it impossible for content filters and ad-blockers to\ndifferentiate between desired and unwanted resources. Where traditional content\nfiltering tools rely on URLs, URR analyzes the code at the AST level, and\nreplaces harmful AST sub-trees with privacy-and-functionality maintaining\nalternatives.\n  We present an open-sourced implementation of URR as a Firefox extension, and\nevaluate it against JavaScript bundles generated by the most popular bundling\nsystem (Webpack) deployed on the Tranco 10k. We measure the performance,\nmeasured by precision (1.00), recall (0.95), and speed (0.43s per-script) when\ndetecting and rewriting three representative privacy harming libraries often\nincluded in JavaScript bundles, and find URR to be an effective approach to a\nlarge-and-growing blind spot unaddressed by current privacy tools.",
    "updated" : "2024-05-01T16:04:42Z",
    "published" : "2024-05-01T16:04:42Z",
    "authors" : [
      {
        "name" : "Mir Masood Ali"
      },
      {
        "name" : "Peter Snyder"
      },
      {
        "name" : "Chris Kanich"
      },
      {
        "name" : "Hamed Haddadi"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.00329v1",
    "title" : "Metric geometry of the privacy-utility tradeoff",
    "summary" : "Synthetic data are an attractive concept to enable privacy in data sharing. A\nfundamental question is how similar the privacy-preserving synthetic data are\ncompared to the true data. Using metric privacy, an effective generalization of\ndifferential privacy beyond the discrete setting, we raise the problem of\ncharacterizing the optimal privacy-accuracy tradeoff by the metric geometry of\nthe underlying space. We provide a partial solution to this problem in terms of\nthe \"entropic scale\", a quantity that captures the multiscale geometry of a\nmetric space via the behavior of its packing numbers. We illustrate the\napplicability of our privacy-accuracy tradeoff framework via a diverse set of\nexamples of metric spaces.",
    "updated" : "2024-05-01T05:31:53Z",
    "published" : "2024-05-01T05:31:53Z",
    "authors" : [
      {
        "name" : "March Boedihardjo"
      },
      {
        "name" : "Thomas Strohmer"
      },
      {
        "name" : "Roman Vershynin"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.DS",
      "math.PR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01494v1",
    "title" : "Navigating Heterogeneity and Privacy in One-Shot Federated Learning with\n  Diffusion Models",
    "summary" : "Federated learning (FL) enables multiple clients to train models collectively\nwhile preserving data privacy. However, FL faces challenges in terms of\ncommunication cost and data heterogeneity. One-shot federated learning has\nemerged as a solution by reducing communication rounds, improving efficiency,\nand providing better security against eavesdropping attacks. Nevertheless, data\nheterogeneity remains a significant challenge, impacting performance. This work\nexplores the effectiveness of diffusion models in one-shot FL, demonstrating\ntheir applicability in addressing data heterogeneity and improving FL\nperformance. Additionally, we investigate the utility of our diffusion model\napproach, FedDiff, compared to other one-shot FL methods under differential\nprivacy (DP). Furthermore, to improve generated sample quality under DP\nsettings, we propose a pragmatic Fourier Magnitude Filtering (FMF) method,\nenhancing the effectiveness of generated data for global model training.",
    "updated" : "2024-05-02T17:26:52Z",
    "published" : "2024-05-02T17:26:52Z",
    "authors" : [
      {
        "name" : "Matias Mendieta"
      },
      {
        "name" : "Guangyu Sun"
      },
      {
        "name" : "Chen Chen"
      }
    ],
    "categories" : [
      "cs.CV",
      "cs.CR",
      "cs.LG"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01492v1",
    "title" : "Exploring Privacy Issues in Mission Critical Communication: Navigating\n  5G and Beyond Networks",
    "summary" : "Mission critical communication (MCC) involves the exchange of information and\ndata among emergency services, including the police, fire brigade, and other\nfirst responders, particularly during emergencies, disasters, or critical\nincidents. The widely-adopted TETRA (Terrestrial Trunked Radio)-based\ncommunication for mission critical services faces challenges including limited\ndata capacity, coverage limitations, spectrum congestion, and security\nconcerns. Therefore, as an alternative, mission critical communication over\ncellular networks (4G and 5G) has emerged. While cellular-based MCC enables\nfeatures like real-time video streaming and high-speed data transmission, the\ninvolvement of network operators and application service providers in the MCC\narchitecture raises privacy concerns for mission critical users and services.\nFor instance, the disclosure of a policeman's location details to the network\noperator raises privacy concerns. To the best of our knowledge, no existing\nwork considers the privacy issues in mission critical system with respect to 5G\nand upcoming technologies. Therefore, in this paper, we analyse the 3GPP\nstandardised MCC architecture within the context of 5G core network concepts\nand assess the privacy implications for MC users, network entities, and MC\nservers. The privacy analysis adheres to the deployment strategies in the\nstandard for MCC. Additionally, we explore emerging 6G technologies, such as\noff-network communications, joint communication and sensing, and non-3GPP\ncommunications, to identify privacy challenges in MCC architecture. Finally, we\npropose privacy controls to establish a next-generation privacy-preserving MCC\narchitecture.",
    "updated" : "2024-05-02T17:25:33Z",
    "published" : "2024-05-02T17:25:33Z",
    "authors" : [
      {
        "name" : "Prajnamaya Dass"
      },
      {
        "name" : "Marcel Gräfenstein"
      },
      {
        "name" : "Stefan Köpsell"
      }
    ],
    "categories" : [
      "cs.NI"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01411v1",
    "title" : "IDPFilter: Mitigating Interdependent Privacy Issues in Third-Party Apps",
    "summary" : "Third-party applications have become an essential part of today's online\necosystem, enhancing the functionality of popular platforms. However, the\nintensive data exchange underlying their proliferation has increased concerns\nabout interdependent privacy (IDP). This paper provides a comprehensive\ninvestigation into the previously underinvestigated IDP issues of third-party\napps. Specifically, first, we analyze the permission structure of multiple app\nplatforms, identifying permissions that have the potential to cause\ninterdependent privacy issues by enabling a user to share someone else's\npersonal data with an app. Second, we collect datasets and characterize the\nextent to which existing apps request these permissions, revealing the\nrelationship between characteristics such as the respective app platform, the\napp's type, and the number of interdependent privacy-related permissions it\nrequests. Third, we analyze the various reasons IDP is neglected by both data\nprotection regulations and app platforms and then devise principles that should\nbe followed when designing a mitigation solution. Finally, based on these\nprinciples and satisfying clearly defined objectives, we propose IDPFilter, a\nplatform-agnostic API that enables application providers to minimize collateral\ninformation collection by filtering out data collected from their users but\nimplicating others as data subjects. We implement a proof-of-concept prototype,\nIDPTextFilter, that implements the filtering logic on textual data, and provide\nits initial performance evaluation with regard to privacy, accuracy, and\nefficiency.",
    "updated" : "2024-05-02T16:02:13Z",
    "published" : "2024-05-02T16:02:13Z",
    "authors" : [
      {
        "name" : "Shuaishuai Liu"
      },
      {
        "name" : "Gergely Biczók"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01312v1",
    "title" : "Privacy-Enhanced Database Synthesis for Benchmark Publishing",
    "summary" : "Benchmarking is crucial for evaluating a DBMS, yet existing benchmarks often\nfail to reflect the varied nature of user workloads. As a result, there is\nincreasing momentum toward creating databases that incorporate real-world user\ndata to more accurately mirror business environments. However, privacy concerns\ndeter users from directly sharing their data, underscoring the importance of\ncreating synthesized databases for benchmarking that also prioritize privacy\nprotection. Differential privacy has become a key method for safeguarding\nprivacy when sharing data, but the focus has largely been on minimizing errors\nin aggregate queries or classification tasks, with less attention given to\nbenchmarking factors like runtime performance. This paper delves into the\ncreation of privacy-preserving databases specifically for benchmarking, aiming\nto produce a differentially private database whose query performance closely\nresembles that of the original data. Introducing PrivBench, an innovative\nsynthesis framework, we support the generation of high-quality data that\nmaintains privacy. PrivBench uses sum-product networks (SPNs) to partition and\nsample data, enhancing data representation while securing privacy. The\nframework allows users to adjust the detail of SPN partitions and privacy\nsettings, crucial for customizing privacy levels. We validate our approach,\nwhich uses the Laplace and exponential mechanisms, in maintaining privacy. Our\ntests show that PrivBench effectively generates data that maintains privacy and\nexcels in query performance, consistently reducing errors in query execution\ntime, query cardinality, and KL divergence.",
    "updated" : "2024-05-02T14:20:24Z",
    "published" : "2024-05-02T14:20:24Z",
    "authors" : [
      {
        "name" : "Yongrui Zhong"
      },
      {
        "name" : "Yunqing Ge"
      },
      {
        "name" : "Jianbin Qin"
      },
      {
        "name" : "Shuyuan Zheng"
      },
      {
        "name" : "Bo Tang"
      },
      {
        "name" : "Yu-Xuan Qiu"
      },
      {
        "name" : "Rui Mao"
      },
      {
        "name" : "Ye Yuan"
      },
      {
        "name" : "Makoto Onizuka"
      },
      {
        "name" : "Chuan Xiao"
      }
    ],
    "categories" : [
      "cs.DB",
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01221v1",
    "title" : "A Survey on Semantic Communication Networks: Architecture, Security, and\n  Privacy",
    "summary" : "Semantic communication, emerging as a breakthrough beyond the classical\nShannon paradigm, aims to convey the essential meaning of source data rather\nthan merely focusing on precise yet content-agnostic bit transmission. By\ninterconnecting diverse intelligent agents (e.g., autonomous vehicles and VR\ndevices) via semantic communications, the semantic communication networks\n(SemComNet) supports semantic-oriented transmission, efficient spectrum\nutilization, and flexible networking among collaborative agents. Consequently,\nSemComNet stands out for enabling ever-increasing intelligent applications,\nsuch as autonomous driving and Metaverse. However, being built on a variety of\ncutting-edge technologies including AI and knowledge graphs, SemComNet\nintroduces diverse brand-new and unexpected threats, which pose obstacles to\nits widespread development. Besides, due to the intrinsic characteristics of\nSemComNet in terms of heterogeneous components, autonomous intelligence, and\nlarge-scale structure, a series of critical challenges emerge in securing\nSemComNet. In this paper, we provide a comprehensive and up-to-date survey of\nSemComNet from its fundamentals, security, and privacy aspects. Specifically,\nwe first introduce a novel three-layer architecture of SemComNet for\nmulti-agent interaction, which comprises the control layer, semantic\ntransmission layer, and cognitive sensing layer. Then, we discuss its working\nmodes and enabling technologies. Afterward, based on the layered architecture\nof SemComNet, we outline a taxonomy of security and privacy threats, while\ndiscussing state-of-the-art defense approaches. Finally, we present future\nresearch directions, clarifying the path toward building intelligent, robust,\nand green SemComNet. To our knowledge, this survey is the first to\ncomprehensively cover the fundamentals of SemComNet, alongside a detailed\nanalysis of its security and privacy issues.",
    "updated" : "2024-05-02T12:04:35Z",
    "published" : "2024-05-02T12:04:35Z",
    "authors" : [
      {
        "name" : "Shaolong Guo"
      },
      {
        "name" : "Yuntao Wang"
      },
      {
        "name" : "Ning Zhang"
      },
      {
        "name" : "Zhou Su"
      },
      {
        "name" : "Tom H. Luan"
      },
      {
        "name" : "Zhiyi Tian"
      },
      {
        "name" : "Xuemin Shen"
      }
    ],
    "categories" : [
      "cs.NI"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01031v1",
    "title" : "The Privacy Power of Correlated Noise in Decentralized Learning",
    "summary" : "Decentralized learning is appealing as it enables the scalable usage of large\namounts of distributed data and resources (without resorting to any central\nentity), while promoting privacy since every user minimizes the direct exposure\nof their data. Yet, without additional precautions, curious users can still\nleverage models obtained from their peers to violate privacy. In this paper, we\npropose Decor, a variant of decentralized SGD with differential privacy (DP)\nguarantees. Essentially, in Decor, users securely exchange randomness seeds in\none communication round to generate pairwise-canceling correlated Gaussian\nnoises, which are injected to protect local models at every communication\nround. We theoretically and empirically show that, for arbitrary connected\ngraphs, Decor matches the central DP optimal privacy-utility trade-off. We do\nso under SecLDP, our new relaxation of local DP, which protects all user\ncommunications against an external eavesdropper and curious users, assuming\nthat every pair of connected users shares a secret, i.e., an information hidden\nto all others. The main theoretical challenge is to control the accumulation of\nnon-canceling correlated noise due to network sparsity. We also propose a\ncompanion SecLDP privacy accountant for public use.",
    "updated" : "2024-05-02T06:14:56Z",
    "published" : "2024-05-02T06:14:56Z",
    "authors" : [
      {
        "name" : "Youssef Allouah"
      },
      {
        "name" : "Anastasia Koloskova"
      },
      {
        "name" : "Aymane El Firdoussi"
      },
      {
        "name" : "Martin Jaggi"
      },
      {
        "name" : "Rachid Guerraoui"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR",
      "cs.DC",
      "math.OC",
      "stat.ML"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01844v1",
    "title" : "A Survey on Privacy-Preserving Caching at Network Edge: Classification,\n  Solutions, and Challenges",
    "summary" : "Caching content at the network edge is a popular and effective technique\nwidely deployed to alleviate the burden of network backhaul, shorten service\ndelay and improve service quality. However, there has been some controversy\nover privacy violations in caching content at the network edge. On the one\nhand, the multi-access open edge network provides an ideal surface for external\nattackers to obtain private data from the edge cache by extracting sensitive\ninformation. On the other hand, privacy can be infringed by curious edge\ncaching providers through caching trace analysis targeting to achieve better\ncaching performance or higher profits. Therefore, an in-depth understanding of\nprivacy issues in edge caching networks is vital and indispensable for creating\na privacy-preserving caching service at the network edge. In this article, we\nare among the first to fill in this gap by examining privacy-preserving\ntechniques for caching content at the network edge. Firstly, we provide an\nintroduction to the background of Privacy-Preserving Edge Caching (PPEC). Next,\nwe summarize the key privacy issues and present a taxonomy for caching at the\nnetwork edge from the perspective of private data. Additionally, we conduct a\nretrospective review of the state-of-the-art countermeasures against privacy\nleakage from content caching at the network edge. Finally, we conclude the\nsurvey and envision challenges for future research.",
    "updated" : "2024-05-03T04:27:32Z",
    "published" : "2024-05-03T04:27:32Z",
    "authors" : [
      {
        "name" : "Xianzhi Zhang"
      },
      {
        "name" : "Yipeng Zhou"
      },
      {
        "name" : "Di Wu"
      },
      {
        "name" : "Shazia Riaz"
      },
      {
        "name" : "Quan Z. Sheng"
      },
      {
        "name" : "Miao Hu"
      },
      {
        "name" : "Linchang Xiao"
      }
    ],
    "categories" : [
      "cs.NI",
      "cs.CR",
      "cs.DC"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01742v1",
    "title" : "Addressing Privacy Concerns in Joint Communication and Sensing for 6G\n  Networks: Challenges and Prospects",
    "summary" : "The vision for 6G extends beyond mere communication, incorporating sensing\ncapabilities to facilitate a diverse array of novel applications and services.\nHowever, the advent of joint communication and sensing (JCAS) technology\nintroduces concerns regarding the handling of sensitive personally identifiable\ninformation (PII) pertaining to individuals and objects, along with external\nthird-party data and disclosure. Consequently, JCAS-based applications are\nsusceptible to privacy breaches, including location tracking, identity\ndisclosure, profiling, and misuse of sensor data, raising significant\nimplications under the European Union's General Data Protection Regulation\n(GDPR) as well as other applicable standards. This paper critically examines\nemergent JCAS architectures and underscores the necessity for network functions\nto enable privacy-specific features in the 6G systems. We propose an enhanced\nJCAS architecture with additional network functions and interfaces,\nfacilitating the management of sensing policies, consent information, and\ntransparency guidelines, alongside the integration of sensing-specific\nfunctions and storage for sensing processing sessions. Furthermore, we conduct\na comprehensive threat analysis for all interfaces, employing security threat\nmodel STRIDE and privacy threat model LINDDUN. We also summarise the identified\nthreats using standard Common Weakness Enumerations (CWEs). Finally, we suggest\nthe security and privacy controls as the mitigating strategies to counter the\nidentified threats stemming from the JCAS architecture.",
    "updated" : "2024-05-02T21:25:24Z",
    "published" : "2024-05-02T21:25:24Z",
    "authors" : [
      {
        "name" : "Prajnamaya Dass"
      },
      {
        "name" : "Sonika Ujjwal"
      },
      {
        "name" : "Jiri Novotny"
      },
      {
        "name" : "Yevhen Zolotavkin"
      },
      {
        "name" : "Zakaria Laaroussi"
      },
      {
        "name" : "Stefan Köpsell"
      }
    ],
    "categories" : [
      "cs.NI"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01716v1",
    "title" : "ATTAXONOMY: Unpacking Differential Privacy Guarantees Against Practical\n  Adversaries",
    "summary" : "Differential Privacy (DP) is a mathematical framework that is increasingly\ndeployed to mitigate privacy risks associated with machine learning and\nstatistical analyses. Despite the growing adoption of DP, its technical privacy\nparameters do not lend themselves to an intelligible description of the\nreal-world privacy risks associated with that deployment: the guarantee that\nmost naturally follows from the DP definition is protection against membership\ninference by an adversary who knows all but one data record and has unlimited\nauxiliary knowledge. In many settings, this adversary is far too strong to\ninform how to set real-world privacy parameters.\n  One approach for contextualizing privacy parameters is via defining and\nmeasuring the success of technical attacks, but doing so requires a systematic\ncategorization of the relevant attack space. In this work, we offer a detailed\ntaxonomy of attacks, showing the various dimensions of attacks and highlighting\nthat many real-world settings have been understudied. Our taxonomy provides a\nroadmap for analyzing real-world deployments and developing theoretical bounds\nfor more informative privacy attacks. We operationalize our taxonomy by using\nit to analyze a real-world case study, the Israeli Ministry of Health's recent\nrelease of a birth dataset using DP, showing how the taxonomy enables\nfine-grained threat modeling and provides insight towards making informed\nprivacy parameter choices. Finally, we leverage the taxonomy towards defining a\nmore realistic attack than previously considered in the literature, namely a\ndistributional reconstruction attack: we generalize Balle et al.'s notion of\nreconstruction robustness to a less-informed adversary with distributional\nuncertainty, and extend the worst-case guarantees of DP to this average-case\nsetting.",
    "updated" : "2024-05-02T20:23:23Z",
    "published" : "2024-05-02T20:23:23Z",
    "authors" : [
      {
        "name" : "Rachel Cummings"
      },
      {
        "name" : "Shlomi Hod"
      },
      {
        "name" : "Jayshree Sarathy"
      },
      {
        "name" : "Marika Swanberg"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.CY"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01704v1",
    "title" : "Privacy-aware Berrut Approximated Coded Computing for Federated Learning",
    "summary" : "Federated Learning (FL) is an interesting strategy that enables the\ncollaborative training of an AI model among different data owners without\nrevealing their private datasets. Even so, FL has some privacy vulnerabilities\nthat have been tried to be overcome by applying some techniques like\nDifferential Privacy (DP), Homomorphic Encryption (HE), or Secure Multi-Party\nComputation (SMPC). However, these techniques have some important drawbacks\nthat might narrow their range of application: problems to work with non-linear\nfunctions and to operate large matrix multiplications and high communication\nand computational costs to manage semi-honest nodes. In this context, we\npropose a solution to guarantee privacy in FL schemes that simultaneously\nsolves the previously mentioned problems. Our proposal is based on the Berrut\nApproximated Coded Computing, a technique from the Coded Distributed Computing\nparadigm, adapted to a Secret Sharing configuration, to provide input privacy\nto FL in a scalable way. It can be applied for computing non-linear functions\nand treats the special case of distributed matrix multiplication, a key\nprimitive at the core of many automated learning tasks. Because of these\ncharacteristics, it could be applied in a wide range of FL scenarios, since it\nis independent of the machine learning models or aggregation algorithms used in\nthe FL scheme. We provide analysis of the achieve privacy and complexity of our\nsolution and, due to the extensive numerical results performed, it can be\nobserved a good trade-off between privacy and precision.",
    "updated" : "2024-05-02T20:03:13Z",
    "published" : "2024-05-02T20:03:13Z",
    "authors" : [
      {
        "name" : "Xavier Martínez Luaña"
      },
      {
        "name" : "Rebeca P. Díaz Redondo"
      },
      {
        "name" : "Manuel Fernández Veiga"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CC",
      "cs.DC",
      "cs.IT",
      "math.IT"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01678v1",
    "title" : "1-Diffractor: Efficient and Utility-Preserving Text Obfuscation\n  Leveraging Word-Level Metric Differential Privacy",
    "summary" : "The study of privacy-preserving Natural Language Processing (NLP) has gained\nrising attention in recent years. One promising avenue studies the integration\nof Differential Privacy in NLP, which has brought about innovative methods in a\nvariety of application settings. Of particular note are $\\textit{word-level\nMetric Local Differential Privacy (MLDP)}$ mechanisms, which work to obfuscate\npotentially sensitive input text by performing word-by-word\n$\\textit{perturbations}$. Although these methods have shown promising results\nin empirical tests, there are two major drawbacks: (1) the inevitable loss of\nutility due to addition of noise, and (2) the computational expensiveness of\nrunning these mechanisms on high-dimensional word embeddings. In this work, we\naim to address these challenges by proposing $\\texttt{1-Diffractor}$, a new\nmechanism that boasts high speedups in comparison to previous mechanisms, while\nstill demonstrating strong utility- and privacy-preserving capabilities. We\nevaluate $\\texttt{1-Diffractor}$ for utility on several NLP tasks, for\ntheoretical and task-based privacy, and for efficiency in terms of speed and\nmemory. $\\texttt{1-Diffractor}$ shows significant improvements in efficiency,\nwhile still maintaining competitive utility and privacy scores across all\nconducted comparative tests against previous MLDP mechanisms. Our code is made\navailable at: https://github.com/sjmeis/Diffractor.",
    "updated" : "2024-05-02T19:07:32Z",
    "published" : "2024-05-02T19:07:32Z",
    "authors" : [
      {
        "name" : "Stephen Meisenbacher"
      },
      {
        "name" : "Maulik Chevli"
      },
      {
        "name" : "Florian Matthes"
      }
    ],
    "categories" : [
      "cs.CL"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01646v1",
    "title" : "Explaining models relating objects and privacy",
    "summary" : "Accurately predicting whether an image is private before sharing it online is\ndifficult due to the vast variety of content and the subjective nature of\nprivacy itself. In this paper, we evaluate privacy models that use objects\nextracted from an image to determine why the image is predicted as private. To\nexplain the decision of these models, we use feature-attribution to identify\nand quantify which objects (and which of their features) are more relevant to\nprivacy classification with respect to a reference input (i.e., no objects\nlocalised in an image) predicted as public. We show that the presence of the\nperson category and its cardinality is the main factor for the privacy\ndecision. Therefore, these models mostly fail to identify private images\ndepicting documents with sensitive data, vehicle ownership, and internet\nactivity, or public images with people (e.g., an outdoor concert or people\nwalking in a public space next to a famous landmark). As baselines for future\nbenchmarks, we also devise two strategies that are based on the person presence\nand cardinality and achieve comparable classification performance of the\nprivacy models.",
    "updated" : "2024-05-02T18:06:48Z",
    "published" : "2024-05-02T18:06:48Z",
    "authors" : [
      {
        "name" : "Alessio Xompero"
      },
      {
        "name" : "Myriam Bontonou"
      },
      {
        "name" : "Jean-Michel Arbona"
      },
      {
        "name" : "Emmanouil Benetos"
      },
      {
        "name" : "Andrea Cavallaro"
      }
    ],
    "categories" : [
      "cs.CV"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.01031v2",
    "title" : "The Privacy Power of Correlated Noise in Decentralized Learning",
    "summary" : "Decentralized learning is appealing as it enables the scalable usage of large\namounts of distributed data and resources (without resorting to any central\nentity), while promoting privacy since every user minimizes the direct exposure\nof their data. Yet, without additional precautions, curious users can still\nleverage models obtained from their peers to violate privacy. In this paper, we\npropose Decor, a variant of decentralized SGD with differential privacy (DP)\nguarantees. Essentially, in Decor, users securely exchange randomness seeds in\none communication round to generate pairwise-canceling correlated Gaussian\nnoises, which are injected to protect local models at every communication\nround. We theoretically and empirically show that, for arbitrary connected\ngraphs, Decor matches the central DP optimal privacy-utility trade-off. We do\nso under SecLDP, our new relaxation of local DP, which protects all user\ncommunications against an external eavesdropper and curious users, assuming\nthat every pair of connected users shares a secret, i.e., an information hidden\nto all others. The main theoretical challenge is to control the accumulation of\nnon-canceling correlated noise due to network sparsity. We also propose a\ncompanion SecLDP privacy accountant for public use.",
    "updated" : "2024-05-03T08:14:22Z",
    "published" : "2024-05-02T06:14:56Z",
    "authors" : [
      {
        "name" : "Youssef Allouah"
      },
      {
        "name" : "Anastasia Koloskova"
      },
      {
        "name" : "Aymane El Firdoussi"
      },
      {
        "name" : "Martin Jaggi"
      },
      {
        "name" : "Rachid Guerraoui"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR",
      "cs.DC",
      "math.OC",
      "stat.ML"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.03636v1",
    "title" : "Federated Learning Privacy: Attacks, Defenses, Applications, and Policy\n  Landscape - A Survey",
    "summary" : "Deep learning has shown incredible potential across a vast array of tasks and\naccompanying this growth has been an insatiable appetite for data. However, a\nlarge amount of data needed for enabling deep learning is stored on personal\ndevices and recent concerns on privacy have further highlighted challenges for\naccessing such data. As a result, federated learning (FL) has emerged as an\nimportant privacy-preserving technology enabling collaborative training of\nmachine learning models without the need to send the raw, potentially\nsensitive, data to a central server. However, the fundamental premise that\nsending model updates to a server is privacy-preserving only holds if the\nupdates cannot be \"reverse engineered\" to infer information about the private\ntraining data. It has been shown under a wide variety of settings that this\npremise for privacy does {\\em not} hold.\n  In this survey paper, we provide a comprehensive literature review of the\ndifferent privacy attacks and defense methods in FL. We identify the current\nlimitations of these attacks and highlight the settings in which FL client\nprivacy can be broken. We dissect some of the successful industry applications\nof FL and draw lessons for future successful adoption. We survey the emerging\nlandscape of privacy regulation for FL. We conclude with future directions for\ntaking FL toward the cherished goal of generating accurate models while\npreserving the privacy of the data from its participants.",
    "updated" : "2024-05-06T16:55:20Z",
    "published" : "2024-05-06T16:55:20Z",
    "authors" : [
      {
        "name" : "Joshua C. Zhao"
      },
      {
        "name" : "Saurabh Bagchi"
      },
      {
        "name" : "Salman Avestimehr"
      },
      {
        "name" : "Kevin S. Chan"
      },
      {
        "name" : "Somali Chaterji"
      },
      {
        "name" : "Dimitris Dimitriadis"
      },
      {
        "name" : "Jiacheng Li"
      },
      {
        "name" : "Ninghui Li"
      },
      {
        "name" : "Arash Nourian"
      },
      {
        "name" : "Holger R. Roth"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.LG",
      "I.2; H.4; I.5"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.03106v1",
    "title" : "Compression-based Privacy Preservation for Distributed Nash Equilibrium\n  Seeking in Aggregative Games",
    "summary" : "This paper explores distributed aggregative games in multi-agent systems.\nCurrent methods for finding distributed Nash equilibrium require players to\nsend original messages to their neighbors, leading to communication burden and\nprivacy issues. To jointly address these issues, we propose an algorithm that\nuses stochastic compression to save communication resources and conceal\ninformation through random errors induced by compression. Our theoretical\nanalysis shows that the algorithm guarantees convergence accuracy, even with\naggressive compression errors used to protect privacy. We prove that the\nalgorithm achieves differential privacy through a stochastic quantization\nscheme. Simulation results for energy consumption games support the\neffectiveness of our approach.",
    "updated" : "2024-05-06T01:42:40Z",
    "published" : "2024-05-06T01:42:40Z",
    "authors" : [
      {
        "name" : "Wei Huo"
      },
      {
        "name" : "Xiaomeng Chen"
      },
      {
        "name" : "Kemi Ding"
      },
      {
        "name" : "Subhrakanti Dey"
      },
      {
        "name" : "Ling Shi"
      }
    ],
    "categories" : [
      "eess.SY",
      "cs.GT",
      "cs.SY"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.03065v1",
    "title" : "Powering the Future of IoT: Federated Learning for Optimized Power\n  Consumption and Enhanced Privacy",
    "summary" : "The widespread use of the Internet of Things has led to the development of\nlarge amounts of perception data, making it necessary to develop effective and\nscalable data analysis tools. Federated Learning emerges as a promising\nparadigm to address the inherent challenges of power consumption and data\nprivacy in IoT environments. This paper explores the transformative potential\nof FL in enhancing the longevity of IoT devices by mitigating power consumption\nand enhancing privacy and security measures. We delve into the intricacies of\nFL, elucidating its components and applications within IoT ecosystems.\nAdditionally, we discuss the critical characteristics and challenges of IoT,\nhighlighting the need for such machine learning solutions in processing\nperception data. While FL introduces many benefits for IoT sustainability, it\nalso has limitations. Through a comprehensive discussion and analysis, this\npaper elucidates the opportunities and constraints of FL in shaping the future\nof sustainable and secure IoT systems. Our findings highlight the importance of\ndeveloping new approaches and conducting additional research to maximise the\nbenefits of FL in creating a secure and privacy-focused IoT environment.",
    "updated" : "2024-05-05T22:18:22Z",
    "published" : "2024-05-05T22:18:22Z",
    "authors" : [
      {
        "name" : "Ghazaleh Shirvani"
      },
      {
        "name" : "Saeid Ghasemshirazi"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.02665v1",
    "title" : "Metric Differential Privacy at the User-Level",
    "summary" : "Metric differential privacy (DP) provides heterogeneous privacy guarantees\nbased on a distance between the pair of inputs. It is a widely popular notion\nof privacy since it captures the natural privacy semantics for many\napplications (such as, for location data) and results in better utility than\nstandard DP. However, prior work in metric DP has primarily focused on the\n\\textit{item-level} setting where every user only reports a single data item. A\nmore realistic setting is that of user-level DP where each user contributes\nmultiple items and privacy is then desired at the granularity of the user's\n\\textit{entire} contribution. In this paper, we initiate the study of metric DP\nat the user-level. Specifically, we use the earth-mover's distance\n($d_\\textsf{EM}$) as our metric to obtain a notion of privacy as it captures\nboth the magnitude and spatial aspects of changes in a user's data.\n  We make three main technical contributions. First, we design two novel\nmechanisms under $d_\\textsf{EM}$-DP to answer linear queries and item-wise\nqueries. Specifically, our analysis for the latter involves a generalization of\nthe privacy amplification by shuffling result which may be of independent\ninterest. Second, we provide a black-box reduction from the general unbounded\nto bounded $d_\\textsf{EM}$-DP (size of the dataset is fixed and public) with a\nnovel sampling based mechanism. Third, we show that our proposed mechanisms can\nprovably provide improved utility over user-level DP, for certain types of\nlinear queries and frequency estimation.",
    "updated" : "2024-05-04T13:29:11Z",
    "published" : "2024-05-04T13:29:11Z",
    "authors" : [
      {
        "name" : "Jacob Imola"
      },
      {
        "name" : "Amrita Roy Chowdhury"
      },
      {
        "name" : "Kamalika Chaudhuri"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.02437v1",
    "title" : "FastLloyd: Federated, Accurate, Secure, and Tunable $k$-Means Clustering\n  with Differential Privacy",
    "summary" : "We study the problem of privacy-preserving $k$-means clustering in the\nhorizontally federated setting. Existing federated approaches using secure\ncomputation, suffer from substantial overheads and do not offer output privacy.\nAt the same time, differentially private (DP) $k$-means algorithms assume a\ntrusted central curator and do not extend to federated settings. Naively\ncombining the secure and DP solutions results in a protocol with impractical\noverhead. Instead, our work provides enhancements to both the DP and secure\ncomputation components, resulting in a design that is faster, more private, and\nmore accurate than previous work. By utilizing the computational DP model, we\ndesign a lightweight, secure aggregation-based approach that achieves four\norders of magnitude speed-up over state-of-the-art related work. Furthermore,\nwe not only maintain the utility of the state-of-the-art in the central model\nof DP, but we improve the utility further by taking advantage of constrained\nclustering techniques.",
    "updated" : "2024-05-03T19:04:37Z",
    "published" : "2024-05-03T19:04:37Z",
    "authors" : [
      {
        "name" : "Abdulrahman Diaa"
      },
      {
        "name" : "Thomas Humphries"
      },
      {
        "name" : "Florian Kerschbaum"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.LG"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.02341v1",
    "title" : "Improved Communication-Privacy Trade-offs in $L_2$ Mean Estimation under\n  Streaming Differential Privacy",
    "summary" : "We study $L_2$ mean estimation under central differential privacy and\ncommunication constraints, and address two key challenges: firstly, existing\nmean estimation schemes that simultaneously handle both constraints are usually\noptimized for $L_\\infty$ geometry and rely on random rotation or Kashin's\nrepresentation to adapt to $L_2$ geometry, resulting in suboptimal leading\nconstants in mean square errors (MSEs); secondly, schemes achieving\norder-optimal communication-privacy trade-offs do not extend seamlessly to\nstreaming differential privacy (DP) settings (e.g., tree aggregation or matrix\nfactorization), rendering them incompatible with DP-FTRL type optimizers.\n  In this work, we tackle these issues by introducing a novel privacy\naccounting method for the sparsified Gaussian mechanism that incorporates the\nrandomness inherent in sparsification into the DP noise. Unlike previous\napproaches, our accounting algorithm directly operates in $L_2$ geometry,\nyielding MSEs that fast converge to those of the uncompressed Gaussian\nmechanism. Additionally, we extend the sparsification scheme to the matrix\nfactorization framework under streaming DP and provide a precise accountant\ntailored for DP-FTRL type optimizers. Empirically, our method demonstrates at\nleast a 100x improvement of compression for DP-SGD across various FL tasks.",
    "updated" : "2024-05-02T03:48:47Z",
    "published" : "2024-05-02T03:48:47Z",
    "authors" : [
      {
        "name" : "Wei-Ning Chen"
      },
      {
        "name" : "Berivan Isik"
      },
      {
        "name" : "Peter Kairouz"
      },
      {
        "name" : "Albert No"
      },
      {
        "name" : "Sewoong Oh"
      },
      {
        "name" : "Zheng Xu"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.LG"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.04344v1",
    "title" : "Enhancing Scalability of Metric Differential Privacy via Secret Dataset\n  Partitioning and Benders Decomposition",
    "summary" : "Metric Differential Privacy (mDP) extends the concept of Differential Privacy\n(DP) to serve as a new paradigm of data perturbation. It is designed to protect\nsecret data represented in general metric space, such as text data encoded as\nword embeddings or geo-location data on the road network or grid maps. To\nderive an optimal data perturbation mechanism under mDP, a widely used method\nis linear programming (LP), which, however, might suffer from a polynomial\nexplosion of decision variables, rendering it impractical in large-scale mDP.\n  In this paper, our objective is to develop a new computation framework to\nenhance the scalability of the LP-based mDP. Considering the connections\nestablished by the mDP constraints among the secret records, we partition the\noriginal secret dataset into various subsets. Building upon the partition, we\nreformulate the LP problem for mDP and solve it via Benders Decomposition,\nwhich is composed of two stages: (1) a master program to manage the\nperturbation calculation across subsets and (2) a set of subproblems, each\nmanaging the perturbation derivation within a subset. Our experimental results\non multiple datasets, including geo-location data in the road network/grid\nmaps, text data, and synthetic data, underscore our proposed mechanism's\nsuperior scalability and efficiency.",
    "updated" : "2024-05-07T14:19:09Z",
    "published" : "2024-05-07T14:19:09Z",
    "authors" : [
      {
        "name" : "Chenxi Qiu"
      }
    ],
    "categories" : [
      "cs.AI",
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.04108v1",
    "title" : "A2-DIDM: Privacy-preserving Accumulator-enabled Auditing for Distributed\n  Identity of DNN Model",
    "summary" : "Recent booming development of Generative Artificial Intelligence (GenAI) has\nfacilitated an emerging model commercialization for the purpose of\nreinforcement on model performance, such as licensing or trading Deep Neural\nNetwork (DNN) models. However, DNN model trading may trigger concerns of the\nunauthorized replications or misuses over the model, so that the benefit of the\nmodel ownership will be violated. Model identity auditing is a challenging\nissue in protecting intellectual property of DNN models and verifying the\nintegrity and ownership of models for guaranteeing trusts in transactions is\none of the critical obstacles. In this paper, we focus on the above issue and\npropose a novel Accumulator-enabled Auditing for Distributed Identity of DNN\nModel (A2-DIDM) that utilizes blockchain and zero-knowledge techniques to\nprotect data and function privacy while ensuring the lightweight on-chain\nownership verification. The proposed model presents a scheme of identity\nrecords via configuring model weight checkpoints with corresponding\nzero-knowledge proofs, which incorporates predicates to capture incremental\nstate changes in model weight checkpoints. Our scheme ensures both\ncomputational integrity of DNN training process and programmability, so that\nthe uniqueness of the weight checkpoint sequence in a DNN model is preserved,\nensuring the correctness of the model identity auditing. In addition, A2-DIDM\nalso addresses privacy protections in distributed identity via a proposed\nmethod of accumulators. We systematically analyze the security and robustness\nof our proposed model and further evaluate the effectiveness and usability of\nauditing DNN model identities.",
    "updated" : "2024-05-07T08:24:50Z",
    "published" : "2024-05-07T08:24:50Z",
    "authors" : [
      {
        "name" : "Tianxiu Xie"
      },
      {
        "name" : "Keke Gai"
      },
      {
        "name" : "Jing Yu"
      },
      {
        "name" : "Liehuang Zhu"
      },
      {
        "name" : "Kim-Kwang Raymond Choo"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.AI"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.04029v1",
    "title" : "Enabling Privacy-Preserving and Publicly Auditable Federated Learning",
    "summary" : "Federated learning (FL) has attracted widespread attention because it\nsupports the joint training of models by multiple participants without moving\nprivate dataset. However, there are still many security issues in FL that\ndeserve discussion. In this paper, we consider three major issues: 1) how to\nensure that the training process can be publicly audited by any third party; 2)\nhow to avoid the influence of malicious participants on training; 3) how to\nensure that private gradients and models are not leaked to third parties. Many\nsolutions have been proposed to address these issues, while solving the above\nthree problems simultaneously is seldom considered. In this paper, we propose a\npublicly auditable and privacy-preserving federated learning scheme that is\nresistant to malicious participants uploading gradients with wrong directions\nand enables anyone to audit and verify the correctness of the training process.\nIn particular, we design a robust aggregation algorithm capable of detecting\ngradients with wrong directions from malicious participants. Then, we design a\nrandom vector generation algorithm and combine it with zero sharing and\nblockchain technologies to make the joint training process publicly auditable,\nmeaning anyone can verify the correctness of the training. Finally, we conduct\na series of experiments, and the experimental results show that the model\ngenerated by the protocol is comparable in accuracy to the original FL approach\nwhile keeping security advantages.",
    "updated" : "2024-05-07T06:03:10Z",
    "published" : "2024-05-07T06:03:10Z",
    "authors" : [
      {
        "name" : "Huang Zeng"
      },
      {
        "name" : "Anjia Yang"
      },
      {
        "name" : "Jian Weng"
      },
      {
        "name" : "Min-Rong Chen"
      },
      {
        "name" : "Fengjun Xiao"
      },
      {
        "name" : "Yi Liu"
      },
      {
        "name" : "Ye Yao"
      }
    ],
    "categories" : [
      "cs.CR",
      "C.2.2; C.2.4; E.3"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.03915v1",
    "title" : "Motivating Users to Attend to Privacy: A Theory-Driven Design Study",
    "summary" : "In modern technology environments, raising users' privacy awareness is\ncrucial. Existing efforts largely focused on privacy policy presentation and\nfailed to systematically address a radical challenge of user motivation for\ninitiating privacy awareness. Leveraging the Protection Motivation Theory\n(PMT), we proposed design ideas and categories dedicated to motivating users to\nengage with privacy-related information. Using these design ideas, we created a\nconceptual prototype, enhancing the current App Store product page. Results\nfrom an online experiment and follow-up interviews showed that our design\neffectively motivated participants to attend to privacy issues, raising both\nthe threat appraisal and coping appraisal, two main factors in PMT. Our work\nindicated that effective design should consider combining PMT components,\ncalibrating information content, and integrating other design elements, such as\nvisual cues and user familiarity. Overall, our study contributes valuable\ndesign considerations driven by the PMT to amplify the motivational aspect of\nprivacy communication.",
    "updated" : "2024-05-07T00:23:42Z",
    "published" : "2024-05-07T00:23:42Z",
    "authors" : [
      {
        "name" : "Varun Shiri"
      },
      {
        "name" : "Maggie Xiong"
      },
      {
        "name" : "Jinghui Cheng"
      },
      {
        "name" : "Jin L. C. Guo"
      }
    ],
    "categories" : [
      "cs.HC"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.03903v1",
    "title" : "Unified Locational Differential Privacy Framework",
    "summary" : "Aggregating statistics over geographical regions is important for many\napplications, such as analyzing income, election results, and disease spread.\nHowever, the sensitive nature of this data necessitates strong privacy\nprotections to safeguard individuals. In this work, we present a unified\nlocational differential privacy (DP) framework to enable private aggregation of\nvarious data types, including one-hot encoded, boolean, float, and integer\narrays, over geographical regions. Our framework employs local DP mechanisms\nsuch as randomized response, the exponential mechanism, and the Gaussian\nmechanism. We evaluate our approach on four datasets representing significant\nlocation data aggregation scenarios. Results demonstrate the utility of our\nframework in providing formal DP guarantees while enabling geographical data\nanalysis.",
    "updated" : "2024-05-06T23:33:52Z",
    "published" : "2024-05-06T23:33:52Z",
    "authors" : [
      {
        "name" : "Aman Priyanshu"
      },
      {
        "name" : "Yash Maurya"
      },
      {
        "name" : "Suriya Ganesh"
      },
      {
        "name" : "Vy Tran"
      }
    ],
    "categories" : [
      "cs.AI",
      "cs.CY"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.00596v2",
    "title" : "Unbundle-Rewrite-Rebundle: Runtime Detection and Rewriting of\n  Privacy-Harming Code in JavaScript Bundles",
    "summary" : "This work presents Unbundle-Rewrite-Rebundle (URR), a system for detecting\nprivacy-harming portions of bundled JavaScript code, and rewriting that code at\nruntime to remove the privacy harming behavior without breaking the surrounding\ncode or overall application. URR is a novel solution to the problem of\nJavaScript bundles, where websites pre-compile multiple code units into a\nsingle file, making it impossible for content filters and ad-blockers to\ndifferentiate between desired and unwanted resources. Where traditional content\nfiltering tools rely on URLs, URR analyzes the code at the AST level, and\nreplaces harmful AST sub-trees with privacy-and-functionality maintaining\nalternatives.\n  We present an open-sourced implementation of URR as a Firefox extension, and\nevaluate it against JavaScript bundles generated by the most popular bundling\nsystem (Webpack) deployed on the Tranco 10k. We measure the performance,\nmeasured by precision (1.00), recall (0.95), and speed (0.43s per-script) when\ndetecting and rewriting three representative privacy harming libraries often\nincluded in JavaScript bundles, and find URR to be an effective approach to a\nlarge-and-growing blind spot unaddressed by current privacy tools.",
    "updated" : "2024-05-07T15:38:20Z",
    "published" : "2024-05-01T16:04:42Z",
    "authors" : [
      {
        "name" : "Mir Masood Ali"
      },
      {
        "name" : "Peter Snyder"
      },
      {
        "name" : "Chris Kanich"
      },
      {
        "name" : "Hamed Haddadi"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.05175v1",
    "title" : "Air Gap: Protecting Privacy-Conscious Conversational Agents",
    "summary" : "The growing use of large language model (LLM)-based conversational agents to\nmanage sensitive user data raises significant privacy concerns. While these\nagents excel at understanding and acting on context, this capability can be\nexploited by malicious actors. We introduce a novel threat model where\nadversarial third-party apps manipulate the context of interaction to trick\nLLM-based agents into revealing private information not relevant to the task at\nhand.\n  Grounded in the framework of contextual integrity, we introduce AirGapAgent,\na privacy-conscious agent designed to prevent unintended data leakage by\nrestricting the agent's access to only the data necessary for a specific task.\nExtensive experiments using Gemini, GPT, and Mistral models as agents validate\nour approach's effectiveness in mitigating this form of context hijacking while\nmaintaining core agent functionality. For example, we show that a single-query\ncontext hijacking attack on a Gemini Ultra agent reduces its ability to protect\nuser data from 94% to 45%, while an AirGapAgent achieves 97% protection,\nrendering the same attack ineffective.",
    "updated" : "2024-05-08T16:12:45Z",
    "published" : "2024-05-08T16:12:45Z",
    "authors" : [
      {
        "name" : "Eugene Bagdasaryan"
      },
      {
        "name" : "Ren Yi"
      },
      {
        "name" : "Sahra Ghalebikesabi"
      },
      {
        "name" : "Peter Kairouz"
      },
      {
        "name" : "Marco Gruteser"
      },
      {
        "name" : "Sewoong Oh"
      },
      {
        "name" : "Borja Balle"
      },
      {
        "name" : "Daniel Ramage"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.CL",
      "cs.LG"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.05930v1",
    "title" : "Trustworthy AI-Generative Content in Intelligent 6G Network:\n  Adversarial, Privacy, and Fairness",
    "summary" : "AI-generated content (AIGC) models, represented by large language models\n(LLM), have brought revolutionary changes to the content generation fields. The\nhigh-speed and extensive 6G technology is an ideal platform for providing\npowerful AIGC mobile service applications, while future 6G mobile networks also\nneed to support intelligent and personalized mobile generation services.\nHowever, the significant ethical and security issues of current AIGC models,\nsuch as adversarial attacks, privacy, and fairness, greatly affect the\ncredibility of 6G intelligent networks, especially in ensuring secure, private,\nand fair AIGC applications. In this paper, we propose TrustGAIN, a novel\nparadigm for trustworthy AIGC in 6G networks, to ensure trustworthy large-scale\nAIGC services in future 6G networks. We first discuss the adversarial attacks\nand privacy threats faced by AIGC systems in 6G networks, as well as the\ncorresponding protection issues. Subsequently, we emphasize the importance of\nensuring the unbiasedness and fairness of the mobile generative service in\nfuture intelligent networks. In particular, we conduct a use case to\ndemonstrate that TrustGAIN can effectively guide the resistance against\nmalicious or generated false information. We believe that TrustGAIN is a\nnecessary paradigm for intelligent and trustworthy 6G networks to support AIGC\nservices, ensuring the security, privacy, and fairness of AIGC network\nservices.",
    "updated" : "2024-05-09T17:16:20Z",
    "published" : "2024-05-09T17:16:20Z",
    "authors" : [
      {
        "name" : "Siyuan Li"
      },
      {
        "name" : "Xi Lin"
      },
      {
        "name" : "Yaju Liu"
      },
      {
        "name" : "Jianhua Li"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.AI",
      "cs.NI"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.05789v1",
    "title" : "High-Performance Privacy-Preserving Matrix Completion for Trajectory\n  Recovery",
    "summary" : "Matrix completion has important applications in trajectory recovery and\nmobile social networks. However, sending raw data containing personal,\nsensitive information to cloud computing nodes may lead to privacy exposure\nissue.The privacy-preserving matrix completion is a useful approach to perform\nmatrix completion while preserving privacy. In this paper, we propose a\nhigh-performance method for privacy-preserving matrix completion. First,we use\na lightweight encryption scheme to encrypt the raw data and then perform matrix\ncompletion using alternating direction method of multipliers (ADMM). Then,the\ncomplemented matrix is decrypted and compared with the original matrix to\ncalculate the error. This method has faster speed with higher accuracy. The\nresults of numerical experiments reveal that the proposed method is faster than\nother algorithms.",
    "updated" : "2024-05-09T14:12:41Z",
    "published" : "2024-05-09T14:12:41Z",
    "authors" : [
      {
        "name" : "Jiahao Guo"
      },
      {
        "name" : "An-Bao Xu"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.NA",
      "math.NA"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.05611v1",
    "title" : "Privacy-Preserving Edge Federated Learning for Intelligent Mobile-Health\n  Systems",
    "summary" : "Machine Learning (ML) algorithms are generally designed for scenarios in\nwhich all data is stored in one data center, where the training is performed.\nHowever, in many applications, e.g., in the healthcare domain, the training\ndata is distributed among several entities, e.g., different hospitals or\npatients' mobile devices/sensors. At the same time, transferring the data to a\ncentral location for learning is certainly not an option, due to privacy\nconcerns and legal issues, and in certain cases, because of the communication\nand computation overheads. Federated Learning (FL) is the state-of-the-art\ncollaborative ML approach for training an ML model across multiple parties\nholding local data samples, without sharing them. However, enabling learning\nfrom distributed data over such edge Internet of Things (IoT) systems (e.g.,\nmobile-health and wearable technologies, involving sensitive personal/medical\ndata) in a privacy-preserving fashion presents a major challenge mainly due to\ntheir stringent resource constraints, i.e., limited computing capacity,\ncommunication bandwidth, memory storage, and battery lifetime. In this paper,\nwe propose a privacy-preserving edge FL framework for resource-constrained\nmobile-health and wearable technologies over the IoT infrastructure. We\nevaluate our proposed framework extensively and provide the implementation of\nour technique on Amazon's AWS cloud platform based on the seizure detection\napplication in epilepsy monitoring using wearable technologies.",
    "updated" : "2024-05-09T08:15:31Z",
    "published" : "2024-05-09T08:15:31Z",
    "authors" : [
      {
        "name" : "Amin Aminifar"
      },
      {
        "name" : "Matin Shokri"
      },
      {
        "name" : "Amir Aminifar"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.05567v1",
    "title" : "Perfect Subset Privacy in Polynomial Computation",
    "summary" : "Delegating large-scale computations to service providers is a common practice\nwhich raises privacy concerns. This paper studies information-theoretic\nprivacy-preserving delegation of data to a service provider, who may further\ndelegate the computation to auxiliary worker nodes, in order to compute a\npolynomial over that data at a later point in time. We study techniques which\nare compatible with robust management of distributed computation systems, an\narea known as coded computing. Privacy in coded computing, however, has\ntraditionally addressed the problem of colluding workers, and assumed that the\nserver that administrates the computation is trusted. This viewpoint of privacy\ndoes not accurately reflect real-world privacy concerns, since normally, the\nservice provider as a whole (i.e., the administrator and the worker nodes) form\none cohesive entity which itself poses a privacy risk. This paper aims to shift\nthe focus of privacy in coded computing to safeguarding the privacy of the user\nagainst the service provider as a whole, instead of merely against colluding\nworkers inside the service provider. To this end, we leverage the recently\ndefined notion of perfect subset privacy, which guarantees zero information\nleakage from all subsets of the data up to a certain size. Using known\ntechniques from Reed-Muller decoding, we provide a scheme which enables\npolynomial computation with perfect subset privacy in straggler-free systems.\nFurthermore, by studying information super-sets in Reed-Muller codes, which may\nbe of independent interest, we extend the previous scheme to tolerate\nstraggling worker nodes inside the service provider.",
    "updated" : "2024-05-09T06:11:58Z",
    "published" : "2024-05-09T06:11:58Z",
    "authors" : [
      {
        "name" : " Zirui"
      },
      {
        "name" : " Deng"
      },
      {
        "name" : "Vinayak Ramkumar"
      },
      {
        "name" : "Netanel Raviv"
      }
    ],
    "categories" : [
      "cs.IT",
      "math.IT"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.04344v2",
    "title" : "Enhancing Scalability of Metric Differential Privacy via Secret Dataset\n  Partitioning and Benders Decomposition",
    "summary" : "Metric Differential Privacy (mDP) extends the concept of Differential Privacy\n(DP) to serve as a new paradigm of data perturbation. It is designed to protect\nsecret data represented in general metric space, such as text data encoded as\nword embeddings or geo-location data on the road network or grid maps. To\nderive an optimal data perturbation mechanism under mDP, a widely used method\nis linear programming (LP), which, however, might suffer from a polynomial\nexplosion of decision variables, rendering it impractical in large-scale mDP.\n  In this paper, our objective is to develop a new computation framework to\nenhance the scalability of the LP-based mDP. Considering the connections\nestablished by the mDP constraints among the secret records, we partition the\noriginal secret dataset into various subsets. Building upon the partition, we\nreformulate the LP problem for mDP and solve it via Benders Decomposition,\nwhich is composed of two stages: (1) a master program to manage the\nperturbation calculation across subsets and (2) a set of subproblems, each\nmanaging the perturbation derivation within a subset. Our experimental results\non multiple datasets, including geo-location data in the road network/grid\nmaps, text data, and synthetic data, underscore our proposed mechanism's\nsuperior scalability and efficiency.",
    "updated" : "2024-05-09T04:36:12Z",
    "published" : "2024-05-07T14:19:09Z",
    "authors" : [
      {
        "name" : "Chenxi Qiu"
      }
    ],
    "categories" : [
      "cs.AI",
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.06307v1",
    "title" : "Smooth Sensitivity for Geo-Privacy",
    "summary" : "Suppose each user $i$ holds a private value $x_i$ in some metric space $(U,\n\\mathrm{dist})$, and an untrusted data analyst wishes to compute $\\sum_i\nf(x_i)$ for some function $f : U \\rightarrow \\mathbb{R}$ by asking each user to\nsend in a privatized $f(x_i)$. This is a fundamental problem in\nprivacy-preserving population analytics, and the local model of differential\nprivacy (LDP) is the predominant model under which the problem has been\nstudied. However, LDP requires any two different $x_i, x'_i$ to be\n$\\varepsilon$-distinguishable, which can be overly strong for\ngeometric/numerical data. On the other hand, Geo-Privacy (GP) stipulates that\nthe level of distinguishability be proportional to $\\mathrm{dist}(x_i, x_i')$,\nproviding an attractive alternative notion of personal data privacy in a metric\nspace. However, existing GP mechanisms for this problem, which add a uniform\nnoise to either $x_i$ or $f(x_i)$, are not satisfactory. In this paper, we\ngeneralize the smooth sensitivity framework from Differential Privacy to\nGeo-Privacy, which allows us to add noise tailored to the hardness of the given\ninstance. We provide definitions, mechanisms, and a generic procedure for\ncomputing the smooth sensitivity under GP equipped with a general metric. Then\nwe present three applications: one-way and two-way threshold functions, and\nGaussian kernel density estimation, to demonstrate the applicability and\nutility of our smooth sensitivity framework.",
    "updated" : "2024-05-10T08:32:07Z",
    "published" : "2024-05-10T08:32:07Z",
    "authors" : [
      {
        "name" : "Yuting Liang"
      },
      {
        "name" : "Ke Yi"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.06261v1",
    "title" : "Improving the Privacy Loss Under User-Level DP Composition for Fixed\n  Estimation Error",
    "summary" : "This paper considers the private release of statistics of several disjoint\nsubsets of a datasets, under user-level $\\epsilon$-differential privacy (DP).\nIn particular, we consider the user-level differentially private release of\nsample means and variances of speed values in several grids in a city, in a\npotentially sequential manner. Traditional analysis of the privacy loss due to\nthe sequential composition of queries necessitates a privacy loss degradation\nby a factor that equals the total number of grids. Our main contribution is an\niterative, instance-dependent algorithm, based on clipping the number of user\ncontributions, which seeks to reduce the overall privacy loss degradation under\na canonical Laplace mechanism, while not increasing the {worst} estimation\nerror among the different grids. We test the performance of our algorithm on\nsynthetic datasets and demonstrate improvements in the privacy loss degradation\nfactor via our algorithm. We also demonstrate improvements in the worst-case\nerror using a simple extension of a pseudo-user creation-based mechanism. An\nimportant component of this analysis is our exact characterization of the\nsensitivities and the worst-case estimation errors of sample means and\nvariances incurred by clipping user contributions in an arbitrary fashion,\nwhich we believe is of independent interest.",
    "updated" : "2024-05-10T06:24:35Z",
    "published" : "2024-05-10T06:24:35Z",
    "authors" : [
      {
        "name" : "V. Arvind Rameshwar"
      },
      {
        "name" : "Anshoo Tandon"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.IT",
      "math.IT"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.07596v1",
    "title" : "Local Mutual-Information Differential Privacy",
    "summary" : "Local mutual-information differential privacy (LMIDP) is a privacy notion\nthat aims to quantify the reduction of uncertainty about the input data when\nthe output of a privacy-preserving mechanism is revealed. We study the relation\nof LMIDP with local differential privacy (LDP), the de facto standard notion of\nprivacy in context-independent (CI) scenarios, and with local information\nprivacy (LIP), the state-of-the-art notion for context-dependent settings. We\nestablish explicit conversion rules, i.e., bounds on the privacy parameters for\na LMIDP mechanism to also satisfy LDP/LIP, and vice versa. We use our bounds to\nformally verify that LMIDP is a weak privacy notion. We also show that\nuncorrelated Gaussian noise is the best-case noise in terms of CI-LMIDP if both\nthe input data and the noise are subject to an average power constraint.",
    "updated" : "2024-05-13T09:58:45Z",
    "published" : "2024-05-13T09:58:45Z",
    "authors" : [
      {
        "name" : "Khac-Hoang Ngo"
      },
      {
        "name" : "Johan Östman"
      },
      {
        "name" : "Alexandre Graell i Amat"
      }
    ],
    "categories" : [
      "cs.IT",
      "math.IT"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.07440v1",
    "title" : "Maximizing Information Gain in Privacy-Aware Active Learning of Email\n  Anomalies",
    "summary" : "Redacted emails satisfy most privacy requirements but they make it more\ndifficult to detect anomalous emails that may be indicative of data\nexfiltration. In this paper we develop an enhanced method of Active Learning\nusing an information gain maximizing heuristic, and we evaluate its\neffectiveness in a real world setting where only redacted versions of email\ncould be labeled by human analysts due to privacy concerns. In the first case\nstudy we examined how Active Learning should be carried out. We found that\nmodel performance was best when a single highly skilled (in terms of the\nlabelling task) analyst provided the labels. In the second case study we used\nconfidence ratings to estimate the labeling uncertainty of analysts and then\nprioritized instances for labeling based on the expected information gain (the\ndifference between model uncertainty and analyst uncertainty) that would be\nprovided by labelling each instance. We found that the information maximization\ngain heuristic improved model performance over existing sampling methods for\nActive Learning. Based on the results obtained, we recommend that analysts\nshould be screened, and possibly trained, prior to implementation of Active\nLearning in cybersecurity applications. We also recommend that the information\ngain maximizing sample method (based on expert confidence) should be used in\nearly stages of Active Learning, providing that well-calibrated confidence can\nbe obtained. We also note that the expertise of analysts should be assessed\nprior to Active Learning, as we found that analysts with lower labelling skill\nhad poorly calibrated (over-) confidence in their labels.",
    "updated" : "2024-05-13T02:58:59Z",
    "published" : "2024-05-13T02:58:59Z",
    "authors" : [
      {
        "name" : "Mu-Huan Miles Chung"
      },
      {
        "name" : "Sharon Li"
      },
      {
        "name" : "Jaturong Kongmanee"
      },
      {
        "name" : "Lu Wang"
      },
      {
        "name" : "Yuhong Yang"
      },
      {
        "name" : "Calvin Giang"
      },
      {
        "name" : "Khilan Jerath"
      },
      {
        "name" : "Abhay Raman"
      },
      {
        "name" : "David Lie"
      },
      {
        "name" : "Mark Chignell"
      }
    ],
    "categories" : [
      "cs.HC",
      "cs.CR",
      "cs.LG"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.07020v1",
    "title" : "Adaptive Online Bayesian Estimation of Frequency Distributions with\n  Local Differential Privacy",
    "summary" : "We propose a novel Bayesian approach for the adaptive and online estimation\nof the frequency distribution of a finite number of categories under the local\ndifferential privacy (LDP) framework. The proposed algorithm performs Bayesian\nparameter estimation via posterior sampling and adapts the randomization\nmechanism for LDP based on the obtained posterior samples. We propose a\nrandomized mechanism for LDP which uses a subset of categories as an input and\nwhose performance depends on the selected subset and the true frequency\ndistribution. By using the posterior sample as an estimate of the frequency\ndistribution, the algorithm performs a computationally tractable subset\nselection step to maximize the utility of the privatized response of the next\nuser. We propose several utility functions related to well-known information\nmetrics, such as (but not limited to) Fisher information matrix, total\nvariation distance, and information entropy. We compare each of these utility\nmetrics in terms of their computational complexity. We employ stochastic\ngradient Langevin dynamics for posterior sampling, a computationally efficient\napproximate Markov chain Monte Carlo method. We provide a theoretical analysis\nshowing that (i) the posterior distribution targeted by the algorithm converges\nto the true parameter even for approximate posterior sampling, and (ii) the\nalgorithm selects the optimal subset with high probability if posterior\nsampling is performed exactly. We also provide numerical results that\nempirically demonstrate the estimation accuracy of our algorithm where we\ncompare it with nonadaptive and semi-adaptive approaches under experimental\nsettings with various combinations of privacy parameters and population\ndistribution parameters.",
    "updated" : "2024-05-11T13:59:52Z",
    "published" : "2024-05-11T13:59:52Z",
    "authors" : [
      {
        "name" : "Soner Aydin"
      },
      {
        "name" : "Sinan Yildirim"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR",
      "stat.ML"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.08801v1",
    "title" : "Prospects of Privacy Advantage in Quantum Machine Learning",
    "summary" : "Ensuring data privacy in machine learning models is critical, particularly in\ndistributed settings where model gradients are typically shared among multiple\nparties to allow collaborative learning. Motivated by the increasing success of\nrecovering input data from the gradients of classical models, this study\naddresses a central question: How hard is it to recover the input data from the\ngradients of quantum machine learning models? Focusing on variational quantum\ncircuits (VQC) as learning models, we uncover the crucial role played by the\ndynamical Lie algebra (DLA) of the VQC ansatz in determining privacy\nvulnerabilities. While the DLA has previously been linked to the classical\nsimulatability and trainability of VQC models, this work, for the first time,\nestablishes its connection to the privacy of VQC models. In particular, we show\nthat properties conducive to the trainability of VQCs, such as a\npolynomial-sized DLA, also facilitate the extraction of detailed snapshots of\nthe input. We term this a weak privacy breach, as the snapshots enable training\nVQC models for distinct learning tasks without direct access to the original\ninput. Further, we investigate the conditions for a strong privacy breach where\nthe original input data can be recovered from these snapshots by classical or\nquantum-assisted polynomial time methods. We establish conditions on the\nencoding map such as classical simulatability, overlap with DLA basis, and its\nFourier frequency characteristics that enable such a privacy breach of VQC\nmodels. Our findings thus play a crucial role in detailing the prospects of\nquantum privacy advantage by guiding the requirements for designing quantum\nmachine learning models that balance trainability with robust privacy\nprotection.",
    "updated" : "2024-05-14T17:49:18Z",
    "published" : "2024-05-14T17:49:18Z",
    "authors" : [
      {
        "name" : "Jamie Heredge"
      },
      {
        "name" : "Niraj Kumar"
      },
      {
        "name" : "Dylan Herman"
      },
      {
        "name" : "Shouvanik Chakrabarti"
      },
      {
        "name" : "Romina Yalovetzky"
      },
      {
        "name" : "Shree Hari Sureshbabu"
      },
      {
        "name" : "Marco Pistoia"
      }
    ],
    "categories" : [
      "quant-ph",
      "cs.LG"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.08698v1",
    "title" : "Byzantine-Resilient Secure Aggregation for Federated Learning Without\n  Privacy Compromises",
    "summary" : "Federated learning (FL) shows great promise in large scale machine learning,\nbut brings new risks in terms of privacy and security. We propose ByITFL, a\nnovel scheme for FL that provides resilience against Byzantine users while\nkeeping the users' data private from the federator and private from other\nusers. The scheme builds on the preexisting non-private FLTrust scheme, which\ntolerates malicious users through trust scores (TS) that attenuate or amplify\nthe users' gradients. The trust scores are based on the ReLU function, which we\napproximate by a polynomial. The distributed and privacy-preserving computation\nin ByITFL is designed using a combination of Lagrange coded computing,\nverifiable secret sharing and re-randomization steps. ByITFL is the first\nByzantine resilient scheme for FL with full information-theoretic privacy.",
    "updated" : "2024-05-14T15:37:56Z",
    "published" : "2024-05-14T15:37:56Z",
    "authors" : [
      {
        "name" : "Yue Xia"
      },
      {
        "name" : "Christoph Hofmeister"
      },
      {
        "name" : "Maximilian Egger"
      },
      {
        "name" : "Rawad Bitar"
      }
    ],
    "categories" : [
      "cs.IT",
      "cs.CR",
      "cs.DC",
      "cs.LG",
      "math.IT"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.08518v1",
    "title" : "Cryptography-Based Privacy-Preserving Method for Distributed\n  Optimization over Time-Varying Directed Graphs with Enhanced Efficiency",
    "summary" : "In this paper, we study the privacy-preserving distributed optimization\nproblem, aiming to prevent attackers from stealing the private information of\nagents. For this purpose, we propose a novel privacy-preserving algorithm based\non the Advanced Encryption Standard (AES), which is both secure and\ncomputationally efficient. By appropriately constructing the underlying weight\nmatrices, our algorithm can be applied to time-varying directed networks. We\nshow that the proposed algorithm can protect an agent's privacy if the agent\nhas at least one legitimate neighbor at the initial iteration. Under the\nassumption that the objective function is strongly convex and Lipschitz smooth,\nwe rigorously prove that the proposed algorithm has a linear convergence rate.\nFinally, the effectiveness of the proposed algorithm is demonstrated by\nnumerical simulations of the canonical sensor fusion problem.",
    "updated" : "2024-05-14T11:48:59Z",
    "published" : "2024-05-14T11:48:59Z",
    "authors" : [
      {
        "name" : "Bing Liu"
      },
      {
        "name" : "Furan Xie"
      },
      {
        "name" : "Li Chai"
      }
    ],
    "categories" : [
      "math.OC"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.08356v1",
    "title" : "A Model-oriented Reasoning Framework for Privacy Analysis of Complex\n  Systems",
    "summary" : "This paper proposes a reasoning framework for privacy properties of systems\nand their environments that can capture any knowledge leaks on different\nlogical levels of the system to answer the question: which entity can learn\nwhat? With the term knowledge we refer to any kind of data, meta-data or\ninterpretation of those that might be relevant. To achieve this, we present a\nmodeling framework that forces the developers to explicitly describe which\nknowledge is available at which entity, which knowledge flows between entities\nand which knowledge can be inferred from other knowledge. In addition, privacy\nrequirements are specified as rules describing forbidden knowledge for\nentities. Our modeling approach is incremental, starting from an abstract view\nof the system and adding details through well-defined transformations. This\nwork is intended to complement existing approaches and introduces steps towards\nmore formal foundations for privacy oriented analyses while keeping them as\naccessible as possible. It is designed to be extensible through schemata and\nvocabulary to enable compatibility with external requirements and standards.",
    "updated" : "2024-05-14T06:52:56Z",
    "published" : "2024-05-14T06:52:56Z",
    "authors" : [
      {
        "name" : "Sebastian Rehms"
      },
      {
        "name" : "Stefan Köpsell"
      },
      {
        "name" : "Verena Klös"
      },
      {
        "name" : "Florian Tschorsch"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.08084v1",
    "title" : "PrivFED -- A Framework for Privacy-Preserving Federated Learning in\n  Enhanced Breast Cancer Diagnosis",
    "summary" : "In the day-to-day operations of healthcare institutions, a multitude of\nPersonally Identifiable Information (PII) data exchanges occur, exposing the\ndata to a spectrum of cybersecurity threats. This study introduces a federated\nlearning framework, trained on the Wisconsin dataset, to mitigate challenges\nsuch as data scarcity and imbalance. Techniques like the Synthetic Minority\nOver-sampling Technique (SMOTE) are incorporated to bolster robustness, while\nisolation forests are employed to fortify the model against outliers. Catboost\nserves as the classification tool across all devices. The identification of\noptimal features for heightened accuracy is pursued through Principal Component\nAnalysis (PCA),accentuating the significance of hyperparameter tuning, as\nunderscored in a comparative analysis. The model exhibits an average accuracy\nof 99.95% on edge devices and 98% on the central server.",
    "updated" : "2024-05-13T18:01:57Z",
    "published" : "2024-05-13T18:01:57Z",
    "authors" : [
      {
        "name" : "Maithili Jha"
      },
      {
        "name" : "S. Maitri"
      },
      {
        "name" : "M. Lohithdakshan"
      },
      {
        "name" : "Shiny Duela J"
      },
      {
        "name" : "K. Raja"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.09306v1",
    "title" : "Words Blending Boxes. Obfuscating Queries in Information Retrieval using\n  Differential Privacy",
    "summary" : "Ensuring the effectiveness of search queries while protecting user privacy\nremains an open issue. When an Information Retrieval System (IRS) does not\nprotect the privacy of its users, sensitive information may be disclosed\nthrough the queries sent to the system. Recent improvements, especially in NLP,\nhave shown the potential of using Differential Privacy to obfuscate texts while\nmaintaining satisfactory effectiveness. However, such approaches may protect\nthe user's privacy only from a theoretical perspective while, in practice, the\nreal user's information need can still be inferred if perturbed terms are too\nsemantically similar to the original ones. We overcome such limitations by\nproposing Word Blending Boxes, a novel differentially private mechanism for\nquery obfuscation, which protects the words in the user queries by employing\nsafe boxes. To measure the overall effectiveness of the proposed WBB mechanism,\nwe measure the privacy obtained by the obfuscation process, i.e., the lexical\nand semantic similarity between original and obfuscated queries. Moreover, we\nassess the effectiveness of the privatized queries in retrieving relevant\ndocuments from the IRS. Our findings indicate that WBB can be integrated\neffectively into existing IRSs, offering a key to the challenge of protecting\nuser privacy from both a theoretical and a practical point of view.",
    "updated" : "2024-05-15T12:51:36Z",
    "published" : "2024-05-15T12:51:36Z",
    "authors" : [
      {
        "name" : "Francesco Luigi De Faveri"
      },
      {
        "name" : "Guglielmo Faggioli"
      },
      {
        "name" : "Nicola Ferro"
      }
    ],
    "categories" : [
      "cs.IR",
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.09234v1",
    "title" : "Enhancing Image Privacy in Semantic Communication over Wiretap Channels\n  leveraging Differential Privacy",
    "summary" : "Semantic communication (SemCom) enhances transmission efficiency by sending\nonly task-relevant information compared to traditional methods. However,\ntransmitting semantic-rich data over insecure or public channels poses security\nand privacy risks. This paper addresses the privacy problem of transmitting\nimages over wiretap channels and proposes a novel SemCom approach ensuring\nprivacy through a differential privacy (DP)-based image protection and\ndeprotection mechanism. The method utilizes the GAN inversion technique to\nextract disentangled semantic features and applies a DP mechanism to protect\nsensitive features within the extracted semantic information. To address the\nnon-invertibility of DP, we introduce two neural networks to approximate the DP\napplication and removal processes, offering a privacy protection level close to\nthat by the original DP process. Simulation results validate the effectiveness\nof our method in preventing eavesdroppers from obtaining sensitive information\nwhile maintaining high-fidelity image reconstruction at the legitimate\nreceiver.",
    "updated" : "2024-05-15T10:30:18Z",
    "published" : "2024-05-15T10:30:18Z",
    "authors" : [
      {
        "name" : "Weixuan Chen"
      },
      {
        "name" : "Shunpu Tang"
      },
      {
        "name" : "Qianqian Yang"
      }
    ],
    "categories" : [
      "eess.IV"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.09230v1",
    "title" : "Reduce to the MACs -- Privacy Friendly Generic Probe Requests",
    "summary" : "Abstract. Since the introduction of active discovery in Wi-Fi networks, users\ncan be tracked via their probe requests. Although manufacturers typically try\nto conceal Media Access Control (MAC) addresses using MAC address\nrandomisation, probe requests still contain Information Elements (IEs) that\nfacilitate device identification. This paper introduces generic probe requests:\nBy removing all unnecessary information from IEs, the requests become\nindistinguishable from one another, letting single devices disappear in the\nlargest possible anonymity set. Conducting a comprehensive evaluation, we\ndemonstrate that a large IE set contained within undirected probe requests does\nnot necessarily imply fast connection establishment. Furthermore, we show that\nminimising IEs to nothing but Supported Rates would enable 82.55% of the\ndevices to share the same anonymity set. Our contributions provide a\nsignificant advancement in the pursuit of robust privacy solutions for wireless\nnetworks, paving the way for more user anonymity and less surveillance in\nwireless communication ecosystems.",
    "updated" : "2024-05-15T10:18:30Z",
    "published" : "2024-05-15T10:18:30Z",
    "authors" : [
      {
        "name" : "Johanna Ansohn McDougall"
      },
      {
        "name" : "Alessandro Brighente"
      },
      {
        "name" : "Anne Kunstmann"
      },
      {
        "name" : "Niklas Zapatka"
      },
      {
        "name" : "Hannes Federrath"
      }
    ],
    "categories" : [
      "cs.CR",
      "cs.NI"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.09014v1",
    "title" : "Feature-based Federated Transfer Learning: Communication Efficiency,\n  Robustness and Privacy",
    "summary" : "In this paper, we propose feature-based federated transfer learning as a\nnovel approach to improve communication efficiency by reducing the uplink\npayload by multiple orders of magnitude compared to that of existing approaches\nin federated learning and federated transfer learning. Specifically, in the\nproposed feature-based federated learning, we design the extracted features and\noutputs to be uploaded instead of parameter updates. For this distributed\nlearning model, we determine the required payload and provide comparisons with\nthe existing schemes. Subsequently, we analyze the robustness of feature-based\nfederated transfer learning against packet loss, data insufficiency, and\nquantization. Finally, we address privacy considerations by defining and\nanalyzing label privacy leakage and feature privacy leakage, and investigating\nmitigating approaches. For all aforementioned analyses, we evaluate the\nperformance of the proposed learning scheme via experiments on an image\nclassification task and a natural language processing task to demonstrate its\neffectiveness.",
    "updated" : "2024-05-15T00:43:19Z",
    "published" : "2024-05-15T00:43:19Z",
    "authors" : [
      {
        "name" : "Feng Wang"
      },
      {
        "name" : "M. Cenk Gursoy"
      },
      {
        "name" : "Senem Velipasalar"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.MA"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.08920v1",
    "title" : "Neural Collapse Meets Differential Privacy: Curious Behaviors of NoisyGD\n  with Near-perfect Representation Learning",
    "summary" : "A recent study by De et al. (2022) has reported that large-scale\nrepresentation learning through pre-training on a public dataset significantly\nenhances differentially private (DP) learning in downstream tasks, despite the\nhigh dimensionality of the feature space. To theoretically explain this\nphenomenon, we consider the setting of a layer-peeled model in representation\nlearning, which results in interesting phenomena related to learned features in\ndeep learning and transfer learning, known as Neural Collapse (NC).\n  Within the framework of NC, we establish an error bound indicating that the\nmisclassification error is independent of dimension when the distance between\nactual features and the ideal ones is smaller than a threshold. Additionally,\nthe quality of the features in the last layer is empirically evaluated under\ndifferent pre-trained models within the framework of NC, showing that a more\npowerful transformer leads to a better feature representation. Furthermore, we\nreveal that DP fine-tuning is less robust compared to fine-tuning without DP,\nparticularly in the presence of perturbations. These observations are supported\nby both theoretical analyses and experimental evaluation. Moreover, to enhance\nthe robustness of DP fine-tuning, we suggest several strategies, such as\nfeature normalization or employing dimension reduction methods like Principal\nComponent Analysis (PCA). Empirically, we demonstrate a significant improvement\nin testing accuracy by conducting PCA on the last-layer features.",
    "updated" : "2024-05-14T19:18:19Z",
    "published" : "2024-05-14T19:18:19Z",
    "authors" : [
      {
        "name" : "Chendi Wang"
      },
      {
        "name" : "Yuqing Zhu"
      },
      {
        "name" : "Weijie J. Su"
      },
      {
        "name" : "Yu-Xiang Wang"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR",
      "cs.CV",
      "stat.ML"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.08801v2",
    "title" : "Prospects of Privacy Advantage in Quantum Machine Learning",
    "summary" : "Ensuring data privacy in machine learning models is critical, particularly in\ndistributed settings where model gradients are typically shared among multiple\nparties to allow collaborative learning. Motivated by the increasing success of\nrecovering input data from the gradients of classical models, this study\naddresses a central question: How hard is it to recover the input data from the\ngradients of quantum machine learning models? Focusing on variational quantum\ncircuits (VQC) as learning models, we uncover the crucial role played by the\ndynamical Lie algebra (DLA) of the VQC ansatz in determining privacy\nvulnerabilities. While the DLA has previously been linked to the classical\nsimulatability and trainability of VQC models, this work, for the first time,\nestablishes its connection to the privacy of VQC models. In particular, we show\nthat properties conducive to the trainability of VQCs, such as a\npolynomial-sized DLA, also facilitate the extraction of detailed snapshots of\nthe input. We term this a weak privacy breach, as the snapshots enable training\nVQC models for distinct learning tasks without direct access to the original\ninput. Further, we investigate the conditions for a strong privacy breach where\nthe original input data can be recovered from these snapshots by classical or\nquantum-assisted polynomial time methods. We establish conditions on the\nencoding map such as classical simulatability, overlap with DLA basis, and its\nFourier frequency characteristics that enable such a privacy breach of VQC\nmodels. Our findings thus play a crucial role in detailing the prospects of\nquantum privacy advantage by guiding the requirements for designing quantum\nmachine learning models that balance trainability with robust privacy\nprotection.",
    "updated" : "2024-05-15T17:46:34Z",
    "published" : "2024-05-14T17:49:18Z",
    "authors" : [
      {
        "name" : "Jamie Heredge"
      },
      {
        "name" : "Niraj Kumar"
      },
      {
        "name" : "Dylan Herman"
      },
      {
        "name" : "Shouvanik Chakrabarti"
      },
      {
        "name" : "Romina Yalovetzky"
      },
      {
        "name" : "Shree Hari Sureshbabu"
      },
      {
        "name" : "Changhao Li"
      },
      {
        "name" : "Marco Pistoia"
      }
    ],
    "categories" : [
      "quant-ph",
      "cs.LG"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2405.05567v1",
    "title" : "Perfect Subset Privacy in Polynomial Computation",
    "summary" : "Delegating large-scale computations to service providers is a common practice\nwhich raises privacy concerns. This paper studies information-theoretic\nprivacy-preserving delegation of data to a service provider, who may further\ndelegate the computation to auxiliary worker nodes, in order to compute a\npolynomial over that data at a later point in time. We study techniques which\nare compatible with robust management of distributed computation systems, an\narea known as coded computing. Privacy in coded computing, however, has\ntraditionally addressed the problem of colluding workers, and assumed that the\nserver that administrates the computation is trusted. This viewpoint of privacy\ndoes not accurately reflect real-world privacy concerns, since normally, the\nservice provider as a whole (i.e., the administrator and the worker nodes) form\none cohesive entity which itself poses a privacy risk. This paper aims to shift\nthe focus of privacy in coded computing to safeguarding the privacy of the user\nagainst the service provider as a whole, instead of merely against colluding\nworkers inside the service provider. To this end, we leverage the recently\ndefined notion of perfect subset privacy, which guarantees zero information\nleakage from all subsets of the data up to a certain size. Using known\ntechniques from Reed-Muller decoding, we provide a scheme which enables\npolynomial computation with perfect subset privacy in straggler-free systems.\nFurthermore, by studying information super-sets in Reed-Muller codes, which may\nbe of independent interest, we extend the previous scheme to tolerate\nstraggling worker nodes inside the service provider.",
    "updated" : "2024-05-09T06:11:58Z",
    "published" : "2024-05-09T06:11:58Z",
    "authors" : [
      {
        "name" : "Zirui Deng"
      },
      {
        "name" : "Vinayak Ramkumar"
      },
      {
        "name" : "Netanel Raviv"
      }
    ],
    "categories" : [
      "cs.IT",
      "math.IT"
    ]
  }
]