[
  {
    "id" : "http://arxiv.org/abs/2502.02520v1",
    "title" : "Privacy by Design for Self-Sovereign Identity Systems: An in-depth\n  Component Analysis completed by a Design Assistance Dashboard",
    "summary" : "The use of Self-Sovereign Identity (SSI) systems for digital identity\nmanagement is gaining traction and interest. Countries such as Bhutan have\nalready implemented an SSI infrastructure to manage the identity of their\ncitizens. The EU, thanks to the revised eIDAS regulation, is opening the door\nfor SSI vendors to develop SSI systems for the planned EU digital identity\nwallet. These developments, which fall within the sovereign domain, raise\nquestions about individual privacy.\n  The purpose of this article is to help SSI solution designers make informed\nchoices to ensure that the designed solution is privacy-friendly. The\nobservation is that the range of possible solutions is very broad, from DID and\nDID resolution methods to verifiable credential types, publicly available\ninformation (e.g. in a blockchain), type of infrastructure, etc. As a result,\nthe article proposes (1) to group the elementary building blocks of a SSI\nsystem into 5 structuring layers, (2) to analyze for each layer the privacy\nimplications of using the chosen building block, and (3) to provide a design\nassistance dashboard that gives the complete picture of the SSI, and shows the\ninterdependencies between architectural choices and technical building blocks,\nallowing designers to make informed choices and graphically achieve a SSI\nsolution that meets their need for privacy.",
    "updated" : "2025-02-04T17:42:29Z",
    "published" : "2025-02-04T17:42:29Z",
    "authors" : [
      {
        "name" : "Montassar Naghmouchi"
      },
      {
        "name" : "Maryline Laurent"
      }
    ],
    "categories" : [
      "cs.ET",
      "cs.CY",
      "cs.SE"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.02514v1",
    "title" : "Privacy Attacks on Image AutoRegressive Models",
    "summary" : "Image autoregressive (IAR) models have surpassed diffusion models (DMs) in\nboth image quality (FID: 1.48 vs. 1.58) and generation speed. However, their\nprivacy risks remain largely unexplored. To address this, we conduct a\ncomprehensive privacy analysis comparing IARs to DMs. We develop a novel\nmembership inference attack (MIA) that achieves a significantly higher success\nrate in detecting training images (TPR@FPR=1%: 86.38% for IARs vs. 4.91% for\nDMs). Using this MIA, we perform dataset inference (DI) and find that IARs\nrequire as few as six samples to detect dataset membership, compared to 200 for\nDMs, indicating higher information leakage. Additionally, we extract hundreds\nof training images from an IAR (e.g., 698 from VAR-d30). Our findings highlight\na fundamental privacy-utility trade-off: while IARs excel in generation quality\nand speed, they are significantly more vulnerable to privacy attacks. This\nsuggests that incorporating techniques from DMs, such as per-token probability\nmodeling using diffusion, could help mitigate IARs' privacy risks. Our code is\navailable at https://github.com/sprintml/privacy_attacks_against_iars.",
    "updated" : "2025-02-04T17:33:08Z",
    "published" : "2025-02-04T17:33:08Z",
    "authors" : [
      {
        "name" : "Antoni Kowalczuk"
      },
      {
        "name" : "Jan Dubiński"
      },
      {
        "name" : "Franziska Boenisch"
      },
      {
        "name" : "Adam Dziedzic"
      }
    ],
    "categories" : [
      "cs.CV",
      "cs.LG"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.02410v1",
    "title" : "Privacy Amplification by Structured Subsampling for Deep Differentially\n  Private Time Series Forecasting",
    "summary" : "Many forms of sensitive data, such as web traffic, mobility data, or hospital\noccupancy, are inherently sequential. The standard method for training machine\nlearning models while ensuring privacy for units of sensitive information, such\nas individual hospital visits, is differentially private stochastic gradient\ndescent (DP-SGD). However, we observe in this work that the formal guarantees\nof DP-SGD are incompatible with timeseries-specific tasks like forecasting,\nsince they rely on the privacy amplification attained by training on small,\nunstructured batches sampled from an unstructured dataset. In contrast, batches\nfor forecasting are generated by (1) sampling sequentially structured time\nseries from a dataset, (2) sampling contiguous subsequences from these series,\nand (3) partitioning them into context and ground-truth forecast windows. We\ntheoretically analyze the privacy amplification attained by this structured\nsubsampling to enable the training of forecasting models with sound and tight\nevent- and user-level privacy guarantees. Towards more private models, we\nadditionally prove how data augmentation amplifies privacy in self-supervised\ntraining of sequence models. Our empirical evaluation demonstrates that\namplification by structured subsampling enables the training of forecasting\nmodels with strong formal privacy guarantees.",
    "updated" : "2025-02-04T15:29:00Z",
    "published" : "2025-02-04T15:29:00Z",
    "authors" : [
      {
        "name" : "Jan Schuchardt"
      },
      {
        "name" : "Mina Dalirrooyfard"
      },
      {
        "name" : "Jed Guzelkabaagac"
      },
      {
        "name" : "Anderson Schneider"
      },
      {
        "name" : "Yuriy Nevmyvaka"
      },
      {
        "name" : "Stephan Günnemann"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR",
      "stat.ML"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.01904v1",
    "title" : "Common Neighborhood Estimation over Bipartite Graphs under Local\n  Differential Privacy",
    "summary" : "Bipartite graphs, formed by two vertex layers, arise as a natural fit for\nmodeling the relationships between two groups of entities. In bipartite graphs,\ncommon neighborhood computation between two vertices on the same vertex layer\nis a basic operator, which is easily solvable in general settings. However, it\ninevitably involves releasing the neighborhood information of vertices, posing\na significant privacy risk for users in real-world applications. To protect\nedge privacy in bipartite graphs, in this paper, we study the problem of\nestimating the number of common neighbors of two vertices on the same layer\nunder edge local differential privacy (edge LDP). The problem is challenging in\nthe context of edge LDP since each vertex on the opposite layer of the query\nvertices can potentially be a common neighbor. To obtain efficient and accurate\nestimates, we propose a multiple-round framework that significantly reduces the\ncandidate pool of common neighbors and enables the query vertices to construct\nunbiased estimators locally. Furthermore, we improve data utility by\nincorporating the estimators built from the neighbors of both query vertices\nand devise privacy budget allocation optimizations. These improve the\nestimator's robustness and consistency, particularly against query vertices\nwith imbalanced degrees. Extensive experiments on 15 datasets validate the\neffectiveness and efficiency of our proposed techniques.",
    "updated" : "2025-02-04T00:33:18Z",
    "published" : "2025-02-04T00:33:18Z",
    "authors" : [
      {
        "name" : "Yizhang He"
      },
      {
        "name" : "Kai Wang"
      },
      {
        "name" : "Wenjie Zhang"
      },
      {
        "name" : "Xuemin Lin"
      },
      {
        "name" : "Ying Zhang"
      }
    ],
    "categories" : [
      "cs.DB"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.01885v1",
    "title" : "A Privacy-Preserving Domain Adversarial Federated learning for\n  multi-site brain functional connectivity analysis",
    "summary" : "Resting-state functional magnetic resonance imaging (rs-fMRI) and its derived\nfunctional connectivity networks (FCNs) have become critical for understanding\nneurological disorders. However, collaborative analyses and the\ngeneralizability of models still face significant challenges due to privacy\nregulations and the non-IID (non-independent and identically distributed)\nproperty of multiple data sources. To mitigate these difficulties, we propose\nDomain Adversarial Federated Learning (DAFed), a novel federated deep learning\nframework specifically designed for non-IID fMRI data analysis in multi-site\nsettings. DAFed addresses these challenges through feature disentanglement,\ndecomposing the latent feature space into domain-invariant and domain-specific\ncomponents, to ensure robust global learning while preserving local data\nspecificity. Furthermore, adversarial training facilitates effective knowledge\ntransfer between labeled and unlabeled datasets, while a contrastive learning\nmodule enhances the global representation of domain-invariant features. We\nevaluated DAFed on the diagnosis of ASD and further validated its\ngeneralizability in the classification of AD, demonstrating its superior\nclassification accuracy compared to state-of-the-art methods. Additionally, an\nenhanced Score-CAM module identifies key brain regions and functional\nconnectivity significantly associated with ASD and MCI, respectively,\nuncovering shared neurobiological patterns across sites. These findings\nhighlight the potential of DAFed to advance multi-site collaborative research\nin neuroimaging while protecting data confidentiality.",
    "updated" : "2025-02-03T23:26:07Z",
    "published" : "2025-02-03T23:26:07Z",
    "authors" : [
      {
        "name" : "Yipu Zhang"
      },
      {
        "name" : "Likai Wang"
      },
      {
        "name" : "Kuan-Jui Su"
      },
      {
        "name" : "Aiying Zhang"
      },
      {
        "name" : "Hao Zhu"
      },
      {
        "name" : "Xiaowen Liu"
      },
      {
        "name" : "Hui Shen"
      },
      {
        "name" : "Vince D. Calhoun"
      },
      {
        "name" : "Yuping Wang"
      },
      {
        "name" : "Hongwen Deng"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.AI",
      "eess.IV"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.01352v1",
    "title" : "Metric Privacy in Federated Learning for Medical Imaging: Improving\n  Convergence and Preventing Client Inference Attacks",
    "summary" : "Federated learning is a distributed learning technique that allows training a\nglobal model with the participation of different data owners without the need\nto share raw data. This architecture is orchestrated by a central server that\naggregates the local models from the clients. This server may be trusted, but\nnot all nodes in the network. Then, differential privacy (DP) can be used to\nprivatize the global model by adding noise. However, this may affect\nconvergence across the rounds of the federated architecture, depending also on\nthe aggregation strategy employed. In this work, we aim to introduce the notion\nof metric-privacy to mitigate the impact of classical server side global-DP on\nthe convergence of the aggregated model. Metric-privacy is a relaxation of DP,\nsuitable for domains provided with a notion of distance. We apply it from the\nserver side by computing a distance for the difference between the local\nmodels. We compare our approach with standard DP by analyzing the impact on six\nclassical aggregation strategies. The proposed methodology is applied to an\nexample of medical imaging and different scenarios are simulated across\nhomogeneous and non-i.i.d clients. Finally, we introduce a novel client\ninference attack, where a semi-honest client tries to find whether another\nclient participated in the training and study how it can be mitigated using DP\nand metric-privacy. Our evaluation shows that metric-privacy can increase the\nperformance of the model compared to standard DP, while offering similar\nprotection against client inference attacks.",
    "updated" : "2025-02-03T13:41:52Z",
    "published" : "2025-02-03T13:41:52Z",
    "authors" : [
      {
        "name" : "Judith Sáinz-Pardo Díaz"
      },
      {
        "name" : "Andreas Athanasiou"
      },
      {
        "name" : "Kangsoo Jung"
      },
      {
        "name" : "Catuscia Palamidessi"
      },
      {
        "name" : "Álvaro López García"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.01306v1",
    "title" : "Expert-Generated Privacy Q&A Dataset for Conversational AI and User\n  Study Insights",
    "summary" : "Conversational assistants process personal data and must comply with data\nprotection regulations that require providers to be transparent with users\nabout how their data is handled. Transparency, in a legal sense, demands\npreciseness, comprehensibility and accessibility, yet existing solutions fail\nto meet these requirements. To address this, we introduce a new\nhuman-expert-generated dataset for Privacy Question-Answering (Q&A), developed\nthrough an iterative process involving legal professionals and conversational\ndesigners. We evaluate this dataset through linguistic analysis and a user\nstudy, comparing it to privacy policy excerpts and state-of-the-art responses\nfrom Amazon Alexa. Our findings show that the proposed answers improve\nusability and clarity compared to existing solutions while achieving legal\npreciseness, thereby enhancing the accessibility of data processing information\nfor Conversational AI and Natural Language Processing applications.",
    "updated" : "2025-02-03T12:30:45Z",
    "published" : "2025-02-03T12:30:45Z",
    "authors" : [
      {
        "name" : "Anna Leschanowsky"
      },
      {
        "name" : "Farnaz Salamatjoo"
      },
      {
        "name" : "Zahra Kolagar"
      },
      {
        "name" : "Birgit Popp"
      }
    ],
    "categories" : [
      "cs.HC"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.00760v1",
    "title" : "Privacy Preserving Properties of Vision Classifiers",
    "summary" : "Vision classifiers are often trained on proprietary datasets containing\nsensitive information, yet the models themselves are frequently shared openly\nunder the privacy-preserving assumption. Although these models are assumed to\nprotect sensitive information in their training data, the extent to which this\nassumption holds for different architectures remains unexplored. This\nassumption is challenged by inversion attacks which attempt to reconstruct\ntraining data from model weights, exposing significant privacy vulnerabilities.\nIn this study, we systematically evaluate the privacy-preserving properties of\nvision classifiers across diverse architectures, including Multi-Layer\nPerceptrons (MLPs), Convolutional Neural Networks (CNNs), and Vision\nTransformers (ViTs). Using network inversion-based reconstruction techniques,\nwe assess the extent to which these architectures memorize and reveal training\ndata, quantifying the relative ease of reconstruction across models. Our\nanalysis highlights how architectural differences, such as input\nrepresentation, feature extraction mechanisms, and weight structures, influence\nprivacy risks. By comparing these architectures, we identify which are more\nresilient to inversion attacks and examine the trade-offs between model\nperformance and privacy preservation, contributing to the development of secure\nand privacy-respecting machine learning models for sensitive applications. Our\nfindings provide actionable insights into the design of secure and\nprivacy-aware machine learning systems, emphasizing the importance of\nevaluating architectural decisions in sensitive applications involving\nproprietary or personal data.",
    "updated" : "2025-02-02T11:50:00Z",
    "published" : "2025-02-02T11:50:00Z",
    "authors" : [
      {
        "name" : "Pirzada Suhail"
      },
      {
        "name" : "Amit Sethi"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR",
      "cs.CV"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.00693v1",
    "title" : "DPBloomfilter: Securing Bloom Filters with Differential Privacy",
    "summary" : "The Bloom filter is a simple yet space-efficient probabilistic data structure\nthat supports membership queries for dramatically large datasets. It is widely\nutilized and implemented across various industrial scenarios, often handling\nmassive datasets that include sensitive user information necessitating privacy\npreservation. To address the challenge of maintaining privacy within the Bloom\nfilter, we have developed the DPBloomfilter. This innovation integrates the\nclassical differential privacy mechanism, specifically the Random Response\ntechnique, into the Bloom filter, offering robust privacy guarantees under the\nsame running complexity as the standard Bloom filter. Through rigorous\nsimulation experiments, we have demonstrated that our DPBloomfilter algorithm\nmaintains high utility while ensuring privacy protections. To the best of our\nknowledge, this is the first work to provide differential privacy guarantees\nfor the Bloom filter for membership query problems.",
    "updated" : "2025-02-02T06:47:50Z",
    "published" : "2025-02-02T06:47:50Z",
    "authors" : [
      {
        "name" : "Yekun Ke"
      },
      {
        "name" : "Yingyu Liang"
      },
      {
        "name" : "Zhizhou Sha"
      },
      {
        "name" : "Zhenmei Shi"
      },
      {
        "name" : "Zhao Song"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.00451v1",
    "title" : "Towards Privacy-aware Mental Health AI Models: Advances, Challenges, and\n  Opportunities",
    "summary" : "Mental illness is a widespread and debilitating condition with substantial\nsocietal and personal costs. Traditional diagnostic and treatment approaches,\nsuch as self-reported questionnaires and psychotherapy sessions, often impose\nsignificant burdens on both patients and clinicians, limiting accessibility and\nefficiency. Recent advances in Artificial Intelligence (AI), particularly in\nNatural Language Processing and multimodal techniques, hold great potential for\nrecognizing and addressing conditions such as depression, anxiety, bipolar\ndisorder, schizophrenia, and post-traumatic stress disorder. However, privacy\nconcerns, including the risk of sensitive data leakage from datasets and\ntrained models, remain a critical barrier to deploying these AI systems in\nreal-world clinical settings. These challenges are amplified in multimodal\nmethods, where personal identifiers such as voice and facial data can be\nmisused. This paper presents a critical and comprehensive study of the privacy\nchallenges associated with developing and deploying AI models for mental\nhealth. We further prescribe potential solutions, including data anonymization,\nsynthetic data generation, and privacy-preserving model training, to strengthen\nprivacy safeguards in practical applications. Additionally, we discuss\nevaluation frameworks to assess the privacy-utility trade-offs in these\napproaches. By addressing these challenges, our work aims to advance the\ndevelopment of reliable, privacy-aware AI tools to support clinical\ndecision-making and improve mental health outcomes.",
    "updated" : "2025-02-01T15:10:02Z",
    "published" : "2025-02-01T15:10:02Z",
    "authors" : [
      {
        "name" : "Aishik Mandal"
      },
      {
        "name" : "Tanmoy Chakraborty"
      },
      {
        "name" : "Iryna Gurevych"
      }
    ],
    "categories" : [
      "cs.CL",
      "cs.AI"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.02913v1",
    "title" : "Privacy Token: Surprised to Find Out What You Accidentally Revealed",
    "summary" : "The widespread deployment of deep learning models in privacy-sensitive\ndomains has amplified concerns regarding privacy risks, particularly those\nstemming from gradient leakage during training. Current privacy assessments\nprimarily rely on post-training attack simulations. However, these methods are\ninherently reactive, unable to encompass all potential attack scenarios, and\noften based on idealized adversarial assumptions. These limitations underscore\nthe need for proactive approaches to privacy risk assessment during the\ntraining process. To address this gap, we propose the concept of privacy\ntokens, which are derived directly from private gradients during training.\nPrivacy tokens encapsulate gradient features and, when combined with data\nfeatures, offer valuable insights into the extent of private information\nleakage from training data, enabling real-time measurement of privacy risks\nwithout relying on adversarial attack simulations. Additionally, we employ\nMutual Information (MI) as a robust metric to quantify the relationship between\ntraining data and gradients, providing precise and continuous assessments of\nprivacy leakage throughout the training process. Extensive experiments validate\nour framework, demonstrating the effectiveness of privacy tokens and MI in\nidentifying and quantifying privacy risks. This proactive approach marks a\nsignificant advancement in privacy monitoring, promoting the safer deployment\nof deep learning models in sensitive applications.",
    "updated" : "2025-02-05T06:20:20Z",
    "published" : "2025-02-05T06:20:20Z",
    "authors" : [
      {
        "name" : "Jiayang Meng"
      },
      {
        "name" : "Tao Huang"
      },
      {
        "name" : "Xin Shi"
      },
      {
        "name" : "Qingyu Huang"
      },
      {
        "name" : "Chen Hou"
      },
      {
        "name" : "Hong Chen"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.02749v1",
    "title" : "Unveiling Privacy and Security Gaps in Female Health Apps",
    "summary" : "Female Health Applications (FHA), a growing segment of FemTech, aim to\nprovide affordable and accessible healthcare solutions for women globally.\nThese applications gather and monitor health and reproductive data from\nmillions of users. With ongoing debates on women's reproductive rights and\nprivacy, it's crucial to assess how these apps protect users' privacy. In this\npaper, we undertake a security and data protection assessment of 45 popular\nFHAs. Our investigation uncovers harmful permissions, extensive collection of\nsensitive personal and medical data, and the presence of numerous third-party\ntracking libraries. Furthermore, our examination of their privacy policies\nreveals deviations from fundamental data privacy principles. These findings\nhighlight a significant lack of privacy and security measures for FemTech apps,\nespecially as women's reproductive rights face growing political challenges.\nThe results and recommendations provide valuable insights for users, app\ndevelopers, and policymakers, paving the way for better privacy and security in\nFemale Health Applications.",
    "updated" : "2025-02-04T22:34:03Z",
    "published" : "2025-02-04T22:34:03Z",
    "authors" : [
      {
        "name" : "Muhammad Hassan"
      },
      {
        "name" : "Mahnoor Jameel"
      },
      {
        "name" : "Tian Wang"
      },
      {
        "name" : "Masooda Bashir"
      }
    ],
    "categories" : [
      "cs.HC",
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.04045v1",
    "title" : "Comparing privacy notions for protection against reconstruction attacks\n  in machine learning",
    "summary" : "Within the machine learning community, reconstruction attacks are a principal\nconcern and have been identified even in federated learning (FL), which was\ndesigned with privacy preservation in mind. In response to these threats, the\nprivacy community recommends the use of differential privacy (DP) in the\nstochastic gradient descent algorithm, termed DP-SGD. However, the\nproliferation of variants of DP in recent years\\textemdash such as metric\nprivacy\\textemdash has made it challenging to conduct a fair comparison between\ndifferent mechanisms due to the different meanings of the privacy parameters\n$\\epsilon$ and $\\delta$ across different variants. Thus, interpreting the\npractical implications of $\\epsilon$ and $\\delta$ in the FL context and amongst\nvariants of DP remains ambiguous. In this paper, we lay a foundational\nframework for comparing mechanisms with differing notions of privacy\nguarantees, namely $(\\epsilon,\\delta)$-DP and metric privacy. We provide two\nfoundational means of comparison: firstly, via the well-established\n$(\\epsilon,\\delta)$-DP guarantees, made possible through the R\\'enyi\ndifferential privacy framework; and secondly, via Bayes' capacity, which we\nidentify as an appropriate measure for reconstruction threats.",
    "updated" : "2025-02-06T13:04:25Z",
    "published" : "2025-02-06T13:04:25Z",
    "authors" : [
      {
        "name" : "Sayan Biswas"
      },
      {
        "name" : "Mark Dras"
      },
      {
        "name" : "Pedro Faustini"
      },
      {
        "name" : "Natasha Fernandes"
      },
      {
        "name" : "Annabelle McIver"
      },
      {
        "name" : "Catuscia Palamidessi"
      },
      {
        "name" : "Parastoo Sadeghi"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR",
      "cs.IT",
      "math.IT"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.03811v1",
    "title" : "Privacy Risks in Health Big Data: A Systematic Literature Review",
    "summary" : "The digitization of health records has greatly improved the efficiency of the\nhealthcare system and promoted the formulation of related research and\npolicies. However, the widespread application of advanced technologies such as\nelectronic health records, genomic data, and wearable devices in the field of\nhealth big data has also intensified the collection of personal sensitive data,\nbringing serious privacy and security issues. Based on a systematic literature\nreview (SLR), this paper comprehensively outlines the key research in the field\nof health big data security. By analyzing existing research, this paper\nexplores how cutting-edge technologies such as homomorphic encryption,\nblockchain, federated learning, and artificial immune systems can enhance data\nsecurity while protecting personal privacy. This paper also points out the\ncurrent challenges and proposes a future research framework in this key area.",
    "updated" : "2025-02-06T06:44:36Z",
    "published" : "2025-02-06T06:44:36Z",
    "authors" : [
      {
        "name" : "Zhang Si Yuan"
      },
      {
        "name" : "Manmeet Mahinderjit Singh"
      }
    ],
    "categories" : [
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.03668v1",
    "title" : "Privacy-Preserving Generative Models: A Comprehensive Survey",
    "summary" : "Despite the generative model's groundbreaking success, the need to study its\nimplications for privacy and utility becomes more urgent. Although many studies\nhave demonstrated the privacy threats brought by GANs, no existing survey has\nsystematically categorized the privacy and utility perspectives of GANs and\nVAEs. In this article, we comprehensively study privacy-preserving generative\nmodels, articulating the novel taxonomies for both privacy and utility metrics\nby analyzing 100 research publications. Finally, we discuss the current\nchallenges and future research directions that help new researchers gain\ninsight into the underlying concepts.",
    "updated" : "2025-02-05T23:24:43Z",
    "published" : "2025-02-05T23:24:43Z",
    "authors" : [
      {
        "name" : "Debalina Padariya"
      },
      {
        "name" : "Isabel Wagner"
      },
      {
        "name" : "Aboozar Taherkhani"
      },
      {
        "name" : "Eerke Boiten"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR"
    ]
  },
  {
    "id" : "http://arxiv.org/abs/2502.02913v2",
    "title" : "Privacy Token: Surprised to Find Out What You Accidentally Revealed",
    "summary" : "The widespread deployment of deep learning models in privacy-sensitive\ndomains has amplified concerns regarding privacy risks, particularly those\nstemming from gradient leakage during training. Current privacy assessments\nprimarily rely on post-training attack simulations. However, these methods are\ninherently reactive, unable to encompass all potential attack scenarios, and\noften based on idealized adversarial assumptions. These limitations underscore\nthe need for proactive approaches to privacy risk assessment during the\ntraining process. To address this gap, we propose the concept of privacy\ntokens, which are derived directly from private gradients during training.\nPrivacy tokens encapsulate gradient features and, when combined with data\nfeatures, offer valuable insights into the extent of private information\nleakage from training data, enabling real-time measurement of privacy risks\nwithout relying on adversarial attack simulations. Additionally, we employ\nMutual Information (MI) as a robust metric to quantify the relationship between\ntraining data and gradients, providing precise and continuous assessments of\nprivacy leakage throughout the training process. Extensive experiments validate\nour framework, demonstrating the effectiveness of privacy tokens and MI in\nidentifying and quantifying privacy risks. This proactive approach marks a\nsignificant advancement in privacy monitoring, promoting the safer deployment\nof deep learning models in sensitive applications.",
    "updated" : "2025-02-06T02:33:11Z",
    "published" : "2025-02-05T06:20:20Z",
    "authors" : [
      {
        "name" : "Jiayang Meng"
      },
      {
        "name" : "Tao Huang"
      },
      {
        "name" : "Xin Shi"
      },
      {
        "name" : "Qingyu Huang"
      },
      {
        "name" : "Chen Hou"
      },
      {
        "name" : "Hong Chen"
      }
    ],
    "categories" : [
      "cs.LG",
      "cs.CR"
    ]
  }
]